{"categories":["Data Management","Data Mining","Machine Learning","Manual","Programming"],"desc":" This book is a significant contribution to the subject of mining time-changing data streams and addresses the design of learning algorithms for this purpose. It introduces new contributions on several different aspects of the problem, identifying research opportunities and increasing the scope for applications. It also includes an in-depth study of stream mining and a theoretical analysis of proposed methods and algorithms. The first section is concerned with the use of an adaptive sliding window algorithm (ADWIN). Since this has rigorous performance guarantees, using it in place of counters or accumulators, it offers the possibility of extending such guarantees to learning and mining algorithms not initially designed for drifting data. Testing with several methods, including Naïve Bayes, clustering, decision trees and ensemble methods, is discussed as well. The second part of the book describes a formal study of connected acyclic graphs, or trees, from the point of view of closure-based mining, presenting efficient algorithms for subtree testing and for mining ordered and unordered frequent closed trees. Lastly, a general methodology to identify closed patterns in a data stream is outlined. This is applied to develop an incremental method, a sliding-window based method, and a method that mines closed trees adaptively from data streams. These are used to introduce classification methods for tree data streams.","details":{"authors":"A. Bifet","format":"pdf","isbn-10":"1607500906","isbn-13":"978-1607500902","pages":"224 pages","publication date":"February 15, 2010","publisher":"IOS Press","size":"7.00Mb"},"img":"http://23.95.221.108/covers/12/123da087183cfad8e6985cfe847f01fd.jpg","link":"https://rapidhosting.info/files/byu","title":"Adaptive Stream Mining: Pattern Learning and Mining from Evolving Data Streams – Volume 207 Frontiers in Artificial Intelligence and Applications"}