{"categories":["Web Development"],"desc":" Get to know exactly what you can achieve in the field of collaboration for your enterprise with this non-technical book on Alfresco Share. It carefully guides you through using the platform via case studies and clear explanations. Overview Understand the concepts and benefits of Share Leverage a single installation to manage multiple sites Case Study-based approach for effective understanding What you will learn from this book Real time understanding of capabilities of Alfresco Share through case study Alfresco share architecture and its administration User management and defining roles and access Configure a Share site Use collaboration features like Wikis, blogs, data Lists, calendar, links, and discussions Manage documents through workflow Configure Share for ease of use Share deployment guidelines Approach Written in an easy-to-read and encouraged-to-try style, this book will take you from the basics of using Share to deploying Alfresco Share through a case-study. The necessary screenshots and thorough explanations are provided. Who this book is written for If you are a business user or content manager looking to implement a collaboration strategy for your enterprise, then this book is for you. Although no knowledge of Alfresco is presumed, exposure to XML and concepts of webscripts and Document Management will help you to get the most from this book. In Detail Alfresco Share is a modern, browser-based platform for social content management and collaboration. Alfresco Share sets the premise for affordable collaboration for enterprises. Based on the sturdy Surf framework, Share leverages dynamic site generation capabilities of Alfresco for better participation amongst enterprise personnel. Do you want to know more about Share? Alfresco Share will guide you through creating and managing sites. The book focuses on business needs rather than technical syntax. The book builds a case study around a sample example","details":{"authors":"Amita Bhandari, Pallika Majmudar, Vinita Choudhary","format":"pdf","isbn-10":"184951710X","isbn-13":"978-1849517102","pages":"360 pages","publication date":"March 14, 2012","publisher":"Packt Publishing","size":"9.00Mb"},"img":"http://23.95.221.108/covers/4a/4a9460bcab9cf8422aeb44b44ae6f189.jpg","link":"https://rapidhosting.info/files/aqa","title":"Alfresco Share"}