{"categories":["Cloud Computing","Operating Systems","Programming","Software"],"desc":" How do you build and deploy applications to be scalable and have high availability? Along with developing the applications, you must also have an infrastructure that can support them. You may need to scale up or add servers, have redundant hardware, and add logic to the application to handle distributed computing and failovers—even if an application is in high demand for only short periods of time. The cloud offers a solution. It is made up of interconnected servers located in various data centers, but you see what appears to be a centralized location that someone else hosts and manages. By removing the responsibility for maintaining an infrastructure, you’re free to concentrate on what matters most: the application. This guide is the third edition of the first volume in a series about Windows Azure. It demonstrates how you can adapt an existing on-premises ASP.NET application to one that operates in the cloud by introducing a fictitious company named Adatum that modifies its expense tracking and reimbursement system, aExpense, so that it can be deployed to Windows Azure. To illustrate the wide range of options and features in Windows Azure, this guide and the code examples available for it show a step-by-step migration process that includes using Windows Azure Web Sites, Virtual Machines, Cloud Services, and SQL Database. Together with useful information on developing, deploying, managing, and costing cloud-hosted applications, this guide provides you with a comprehensive resource for moving your applications to Window Azure. This book is intended for any architect, developer, or information technology (IT) professional who designs, builds, or operates applications and services that are appropriate for the cloud. Although applications do not need to be based on the Microsoft Windows operating system to work in Windows Azure or written using a .NET language, this book is written for people who work with Windows-based systems. You should be familiar with the.NET Framework, Visual Studio, ASP.NET, and Visual C#.","details":{"authors":"Alejandro Jezierski, Masashi Narumoto, Hanzhong Zhang","format":"pdf","isbn-10":"1621140202","isbn-13":"978-1621140207","pages":"206 pages","publication date":"March 4, 2013","publisher":"Microsoft patterns & practices","size":"3.00Mb"},"img":"http://23.95.221.108/covers/9d/9db6e6afd32dc00073ffaf385e91d3f0.jpg","link":"https://rapidhosting.info/files/bpj","title":"Moving Applications to the Cloud on Windows Azure (Microsoft patterns & practices)"}