{"categories":["Programming","Scripting","Web Development"],"desc":" If your development involves working with dates and times, then this book is a must-have. In this book, Derick Rethans (contributor to PHP’s core date extension and well-known PHP expert) explores in great detail the subtle nuances of working with dates and times. Frequently PHP developers encounter unexpected results that adversely affect their software and web applications. This book will undoubtedly help them tackle those issues. This book covers a variety of areas including:  history of calendars and time standards, giving the reader a better understanding of how date/time concepts evolved into the way they are today parsing date/time strings and the potential pitfalls a developer can encounter timezones, the quirks inherent in them, and how your application can handle these quirks formatting and representing times and dates correctly and dealing with the DateTime Object manipulating and working with past, future and recurring dates obtaining dates when timestamps aren’t available format specifiers upgrading the master timezone database What are PHP experts saying about this book? “Complex date and time programming isn’t just for international applications. Even in the US, we have to deal with up to nine different time zones, and shifting between these can be difficult. Derick is one of the most knowledgeable people I know when it comes to date and time programming. I have turned to him countless times for help, and now he brings that depth of knowledge to this book. If you need to parse dates and times, shift between time zones, or manipulate dates and times in your applications then this book is for you.” – Ben Ramsey “If you ever have to deal with parsing or formatting timestamps, or dealing with timezones this is the definite reference to make your time related PHP coding tasks fast and simple!” -Elizabeth Marie Smith  This is the most comprehensive book on date/time data for PHP available, and one that any PHP developer can’t do without.","details":{"authors":"Derick Rethans","format":"pdf","isbn-10":"0981034500","isbn-13":"978-0981034508","pages":"152 pages","publication date":"April 20, 2009","publisher":"musketeers.me, LLC","size":"2.00Mb"},"img":"http://23.95.221.108/covers/ed/ed1c41beff9d84dcd23f52571dc5640f.jpg","link":"https://rapidhosting.info/files/9jq","title":"PHP/Architect’s Guide to Date and Time Programming"}