{"categories":["Programming","Scripting","Web Development"],"desc":" With the advent of HTML5, front-end MVC, and Node.js, JavaScript is ubiquitous–and still messy. This book will give you a solid foundation for managing async tasks without losing your sanity in a tangle of callbacks. It’s a fast-paced guide to the most essential techniques for dealing with async behavior, including PubSub, evented models, and Promises. With these tricks up your sleeve, you’ll be better prepared to manage the complexity of large web apps and deliver responsive code.  With Async JavaScript, you’ll develop a deeper understanding of the JavaScript language. You’ll start with a ground-up primer on the JavaScript event model–key to avoiding many of the most common mistakes JavaScripters make. From there you’ll see tools and design patterns for turning that conceptual understanding into practical code.  The concepts in the book are illustrated with runnable examples drawn from both the browser and the Node.js server framework, incorporating complementary libraries including jQuery, Backbone.js, and Async.js. You’ll learn how to create dynamic web pages and highly concurrent servers by mastering the art of distributing events to where they need to be handled, rather than nesting callbacks within callbacks within callbacks.  Async JavaScript will get you up and running with real web development quickly. By the time you’ve finished the Promises chapter, you’ll be parallelizing Ajax requests or running animations in sequence. By the end of the book, you’ll even know how to leverage Web Workers and AMD for JavaScript applications with cutting-edge performance. Most importantly, you’ll have the knowledge you need to write async code with confidence.  What You Need:  Basic knowledge of JavaScript is recommended. If you feel that you’re not up to speed, see the “Resources for Learning JavaScript” section in the preface.","details":{"authors":"Trevor Burnham","format":"pdf","isbn-10":"1937785270","isbn-13":"978-1937785277","pages":"106 pages","publication date":"December 8, 2012","publisher":"Pragmatic Bookshelf","size":"2.60Mb"},"img":"http://23.95.221.108/covers/0a/0a471f40df43ebd0905f7117b9a21b4e.jpg","link":"https://rapidhosting.info/files/976","title":"Async JavaScript: Build More Responsive Apps with Less Code (Pragmatic Express)"}