{"categories":["Digital Design/Media"],"desc":" Key Features Develop realistic and awesome machines for your 3D projects and animation films Gain the ability to look at a piece of machinery in real life and then recreate it in Blender Develop a comprehensive skill set covering key aspects of mechanical modeling Book Description Blender 3D is one of the top pieces of 3D animation software. Machine modeling is an essential aspect of war games, space games, racing games, and animated action films. As the Blender software grows more powerful and popular, there is a demand to take your modeling skills to the next level. This book will cover all the topics you need to create professional models and renders. This book will help you develop a comprehensive skill set that covers the key aspects of mechanical modeling. Through this book, you will create many types of projects, including a pistol, spacecraft, robot, and a racer. We start by making a Sci-fi pistol, creating its basic shape and adding details to it. Moving on, you’ll discover modeling techniques for larger objects such as a space craft and take a look at how different techniques are required for freestyle modeling. After this, we’ll create the basic shapes for the robot and combine the meshes to create unified objects. We’ll assign materials and explore the various options for freestyle rendering. We’ll discuss techniques to build low-poly models, create a low-poly racer, and explain how they differ from the high poly models we created previously. By the end of this book, you will have mastered a workflow that you will be able to apply to your own creations. What you will learn Reacquaint yourself with Blender’s modeling toolset Practice fundamental skills that are applicable to a range of modeling projects Know when and where to use various types of geometry – something that saves time in one instance will pose significant problems in another Think ahead and plan your project out to significantly improve both","details":{"authors":"Christopher Kuhn","format":"pdf","isbn-10":"1785282018","isbn-13":"978-1785282010","pages":"392 pages","publication date":"February 29, 2016","publisher":"Packt Publishing - ebooks Account","size":"23.36Mb"},"img":"http://23.95.221.108/covers/1f/1ff3af80f95ac843fbee186c47424608.jpg","link":"https://rapidhosting.info/files/ct0","title":"Blender 3D Incredible Machines"}