{"categories":["Uncategorized"],"desc":" The content of this book is intended to provide the toxicologist in drug development in the pharmaceutical and biotechnology industries with a broad understanding of bone and its interactions with other organ systems in safety assessments.  The book is divided into three parts.  The first part describes our current understanding of bone biology and its primary regulatory pathways.  Additional chapters address regulatory and study design considerations for incorporating bone end points in toxicology studies, with special consideration being given to juvenile toxicology studies.  This is intended to address recent regulatory requirements to evaluate skeletal development for drugs in development for pediatric populations.  The second part of the book describes the principal techniques and methods used in bone research; understanding how these end-points are derived is fundamental to their appropriate application.  These first two parts of the book provide the background and the means to develop the concepts in part three which describes bone and its interaction with other organ systems.  The unique series of chapters in part three, contributed to by key leaders in their respective fields and in bone research, provides a comprehensive collective work.  Although constantly evolving, the crosstalk and interaction of the skeleton with several organ systems is now recognized and well documented, such as for the reproductive system, muscle and kidney, while our understanding of the interaction with other organ systems, such as the immune system and CNS, is in its infancy. Recent work highlights the key role of the skeleton in the regulation of energy metabolism and the impact this has on research in metabolic diseases such as obesity and diabetes. The hope is that this book will enlighten many and encourage more to explore the impact of new compounds on the skeleton in the development of effective and safe drugs.","details":{"authors":"Susan Y. Smith, Aurore Varela, Rana Samadfam","format":"pdf","isbn-10":"3319561901","isbn-13":"978-3319561905","pages":"474 pages","publication date":"September 30, 2017","publisher":"Springer","size":"10.98Mb"},"img":"http://23.95.221.108/covers/83/838e4a42812f849ab7666044d52723ae.jpg","link":"https://rapidhosting.info/files/fgw","title":"Bone Toxicology (Molecular and Integrative Toxicology)"}