{"categories":["Programming","Web Development"],"desc":" Walk through the steps you need to build your very own WordPress theme!  Included with the book is a WordPress theme and other necessary files, so roll up your sleeves and let Joe take you through the process explaining what you need to do – and why you’re doing it – every step of the way.  Hi, I’m Joe, the author of Building WordPress Themes From Scratch, and what started out as a simple, open source blogging platform has now become a super-powerful content management system (CMS) that can boast that it’s the most widely-used CMS on the Internet.  From the moment I first started using WordPress about eight years ago, I fell in love with it straight away and immediately started hacking away at it, learning the platform, making my own changes, and watching it grow over the years.  In this book, I plan to teach you how to use WordPress, as well as how to leverage the API to create your own custom themes, plugins, and content types. In other words, I will show you how to make WordPress your own.  I’d like to say that this book is for anyone interested in WordPress, regardless of background. However, to keep it streamlined, I do assume that you have a solid understanding of HTML, CSS, JavaScript, PHP and MySQL.  I will be look­ing at converting HTML to a WordPress theme, building plugins, and more, all from scratch.  So, if you’d like to learn how to do all of this, then this book will be right up your alley!  Packaged with this book, you will find:  1) A fully functioning WordPress theme called ‘Director’.   2) A set of PSD files for the Homepage, Directory Page, Blog, and Single Business Page.      3) A set of HTML files created from the PSDs. They will be used to create the ‘Director’ WordPress theme.  4) On top of the four pages created from the PSDs, the HTML folder also includes a /css/ folder for four CSS files: style.css, reset.css, master.css, and ie.css. APlus, al images used in the HTML template are also included.  WHAT THIS BOOK COVERS:  This book reads much like a long, multi-part tutorial, where I take you through my design process, explaining what I do (and why I do it) every step of the way.  Although it’s a fairly linear guide, my hope is that you can visit any main section of the book for quick reference. So, here’s what I’ll be doing:  1. Converting HTML/CSS to a Dynamic WordPress Theme  Included with the book is a PSD that I’ve transformed into HTML. The first part of this book will be taking the resulting HTML/CSS and converting it to a WordPress theme. Along the way, I’ll talk about the various theme pages we’re working with, the WordPress theme hierarchy, and of course, the WordPress Loop.  2. Creating a Custom Post Type  This, in my humble opinion, is one of the best additions to WordPress in recent releases. With the ability to make your own content types — each with its own theme template — you can take WordPress from being a CMS only limited to blog posts and pages, to a CMS that can manage any kind of content you can imagine. In this book, we’ll be creating a business listing type, which will allow us to create a business directory.  3. Theme Options and Widgets  With WordPress, you can make a theme your own by adding a ‘theme options’ page and custom widgets. In this section, we’ll make it very easy for people who use our themes to add their own cus­tomizations without delving into the code or creating a child theme.  4. Creating a Plugin  One of the most powerful facets of WordPress is the fact that it’s pluggable. We can add func­tionality to our installation of WordPress without changing the core WordPress files. There are vast directories of both free and premium plugins available that vastly expand the capabilities of WordPress. In this final section of this book, we will build our own plugin.","details":{"authors":"Joe Casabona","format":"pdf","isbn-10":"1477480994","isbn-13":"978-1477480991","pages":"144 pages","publication date":"May 18, 2012","publisher":"CreateSpace Independent Publishing Platform","size":"8.00Mb"},"img":"http://23.95.221.108/covers/3b/3b115bf06fec81eff0ca1a69ae651da5.jpg","link":"https://rapidhosting.info/files/boz","title":"Building WordPress Themes from Scratch"}