{"categories":["Engineering","Programming","Software"],"desc":" Build an Automated Stock Trading System in Excel is a step-by-step how to guide on building a sophisticated automated stock trading model using Microsoft Excel. Microsoft’s Visual Basic (VBA) language is used in conjunction with Excel’s user interface, formulas, and calculation capabilities to deliver a powerful and flexible trading tool. The Model includes five proven technical indicators (ADX, moving average crossovers, stochastics, Bollinger bands, and DMI). You are guided in a detailed fashion through creating worksheets, files, ranges, indicator formulas, control buttons, DDE/Active-X links, and code modules. The model incorporates both trend-trading and swing-trading features. The swing-trading feature can be turned on or off, depending upon your investing style. After building the model, you simply import the data you need, run the model automatically with a click of a button, and make your trading decisions. The system operates with your choice of FREE ASCII .TXT files available on the internet (from Yahoo Finance or other provider), or your subscription data service (with our without a DDE link). The model can be used alone or in conjunction with your existing fundamental and market analysis to improve investment timing and avoid unprofitable situations. A separate pre-built Backtesting Model is included by email for historical analysis and testing various stocks and time periods. What You Get: A Tremendous 3-in-1 Value! – A complete how to guide PLUS VBA Code and FAQs sections. – Detailed instructions on importing price data into Excel using a DDE link or Yahoo Finance. – Pre-built Backtesting Model in Excel with graphs and trade statistics for your historical analysis. Features & Benefits: – Learn to integrate Excel, VBA, formulas, and data sources into a profitable trading tool. – Acquire unique knowledge applicable to any Excel modeling or analysis project. – Save money by eliminating recurring software costs. – Calculate trading signals on a large number of stocks within seconds. Technical Requirements: – Microsoft Excel – 2 megabytes disk space (for files and stock data storage) – Intraday, daily, or weekly Open-High-Low-Close-Volume price data – Internet access","details":{"authors":"Lawrence H. Klamecki","format":"azw3","isbn-10":"1481065637","isbn-13":"978-1481065634","pages":"70 pages","publication date":"December 7, 2012","publisher":"CreateSpace Independent Publishing Platform","size":"1.93Mb"},"img":"http://23.95.221.108/covers/ac/ac7e4068c11b14bfdf2b83494d49b11f.jpg","link":"https://rapidhosting.info/files/e90","title":"Build an Automated Stock Trading System in Excel"}