{"categories":["Cloud Computing","Manual"],"desc":" Over 35 recipes to help you implement a fully featured XenDesktop 7 architecture with a rich and powerful VDI experience About This Book mplement the XenDesktop 7 architecture and its satellite components Learn how to publish desktops and applications to the end-user devices, optimizing their performance and increasing the general security. Designed in a manner which will allow you to progress gradually from one chapter to another or to implement a single component only referring to the specific topic Who This Book Is For If you are a system administrator or an experienced IT professional who wants to refer to a centralized container of procedures and advanced tasks in XenDesktop, this is the book for you. If you are an IT technician approaching this technology for the first time, who wants to integrate a more theoretical formative process with step-by-step installation and configuration activities, this book will also help you. You will need to have experience of the virtualized environment and an understanding of the general concepts of desktop virtualization (VDI). What You Will Learn Understand the upgrade and installation procedures for the core infrastructural components Deploy and optimize procedures for the desktop virtual machines Install and configure collateral platforms such as the Cloud Bridge platform Perform the desktop and applications deployment through the XenDesktop core as well as the integrated publishing platforms, such as Microsoft App-V Execute the most advanced activities in the VDI environment Tune and secure the Citrix sites Complete implementation activities using the Citrix Powershell modules In Detail Citrix is an established name in today’s Bring Your Own Device (BYOD) era by virtue of their desktop and application virtualization platforms, with the capability to assign applications and contents in a secure manner. XenDesktop 7 is the union of the two historical products developed","details":{"authors":"Gaspare A. Silvestri","format":"pdf","isbn-10":"1782177469","isbn-13":"978-1782177463","pages":"410 pages","publication date":"January 24, 2014","publisher":"Packt Publishing","size":"9.22Mb"},"img":"http://23.95.221.108/covers/7a/7a7914db44824cc4cc69f79ed5f7c6e6.jpg","link":"https://rapidhosting.info/files/dxw","title":"Citrix® XenDesktop® 7 Cookbook (Quick Answers to Common Problems)"}