{"categories":["Engineering","Programming"],"desc":" Over the past decade, Cognitive Work Analysis (CWA) has been one of the popular human factors approaches for complex systems evaluation and design applications. This is reflected by a diverse range of applications across safety critical domains. The book brings together a series of CWA applications and discussions from world-leading human factors researchers and practitioners. It begins with an overview of the CWA framework, including its theoretical underpinnings, the methodological approaches involved (including practical guidance on each phase), and previous applications of the framework. The core of the book is a series of CWA applications, undertaken in a wide range of safety critical domains for a range of purposes. These serve to demonstrate the contribution that CWA can make to real-world projects and provide readers with inspiration for how such analyses can be practically carried out. Following this, a series of applications in which new approaches or adaptations have been added to the framework are presented. These show how practical applications feedback into the theories/approaches underpinning CWA. The closing chapter then speculates on future applications of the framework and on a series of new research directions required in order to enhance its utility. In emphasising the practical realities of performing CWA, and the real-world impacts it can provide, the book tackles several common misconceptions in a constructive and persuasive way. It provides a welcome demonstration of how CWA can be a powerful ally in tackling complexity-related problems that afflict systems in all areas.","details":{"authors":"Neville A. Stanton, Paul M. Salmon, Guy H. Walker, Daniel P. Jenkins","format":"epub","isbn-10":"1472443926","isbn-13":"978-1472443922","pages":"450 pages","publication date":"June 9, 2017","publisher":"CRC Press","size":"22.22Mb"},"img":"http://23.95.221.108/covers/fa/fa13edad661c6734aaba949c227cb853.jpg","link":"https://rapidhosting.info/files/9ul","title":"Cognitive Work Analysis: Applications, Extensions and Future Directions"}