{"categories":["Computing","Machine Learning","Sysadmin"],"desc":" We describe in this book, bio-inspired models and applications of hybrid intel- gent systems using soft computing techniques for image analysis and pattern r- ognition based on biometrics and other information sources. Soft Computing (SC) consists of several intelligent computing paradigms, including fuzzy logic, neural networks, and bio-inspired optimization algorithms, which can be used to produce powerful hybrid intelligent systems. The book is organized in five main parts, which contain a group of papers around a similar subject. The first part consists of papers with the main theme of classification methods and applications, which are basically papers that propose new models for classification to solve general pr- lems and applications. The second part contains papers with the main theme of modular neural networks in pattern recognition, which are basically papers using bio-inspired techniques, like modular neural networks, for achieving pattern r- ognition based on biometric measures. The third part contains papers with the theme of bio-inspired optimization methods and applications to diverse problems. The fourth part contains papers that deal with general theory and algorithms of bio-inspired methods, like neural networks and evolutionary algorithms. The fifth part contains papers on computer vision applications of soft computing methods. In the part of classification methods and applications there are 5 papers that – scribe different contributions on fuzzy logic and bio-inspired models with appli- tion in classification for medical images and other data.","details":{"authors":"Patricia Melin, Witold Pedrycz","format":"pdf","isbn-10":"3642151108","isbn-13":"978-3642151101","pages":"456 pages","publication date":"September 21, 2010","publisher":"Springer","size":"12.90Mb"},"img":"http://23.95.221.108/covers/e8/e8c94d050bfa7fa02ff685ff24950568.jpg","link":"https://rapidhosting.info/files/bzx","title":"Soft Computing for Recognition based on Biometrics (Studies in Computational Intelligence)"}