{"categories":["Cloud Computing"],"desc":" The federal government is expected to spend $75 billion this year on IT projects, with a significant part of that money earmarked for migrating services and programs to cloud computing. Therefore, the publication of this book on cloud computing contracting for government could not be timelier. This comprehensive, expert book uses an easy-to-understand, easy-to-follow six-step process that guides you through the complete contract lifecycle. It steers you through all the cloud service and deployment models available, highlighting the benefits and downsides of each.  Discussed in detail are critical issues, such as security, vendor lock-in, and legal and regulatory obligations. The book discusses how to identify and determine your needs in order to develop a business use case. It defines all the potential procurement vehicles and processes and how to assess them. There is guidance on setting up an acquisition team, developing performance-based work statements and how to measure and manage performance. Included in this book is a 137 element checklist of contract terms that should be considered for your cloud contract solution.  This 10-page check list is a treasure trove of critical information for any cloud program manager and/or contracting manager. All of this vital information has to be gathered, understood and analyzed before the contract can be agreed. upon. How to build and finalize the right contract constitutes a large part of this book, with insight on all the clauses used by vendors – all the things you should know but they are unlikely to tell you! There are also samples to show how potentially harmful vendor clauses can be rephrased to your advantage. The final step discusses managing the contract – how to ensure compliance, conduct audits and what to do in the event of data breaches or worse. Each step is accompanied by case studies, mistakes made and lessons learned, best practices and checklists to ensure you stay on the right path. While the book itself is comprehensive, there is also a dedicated website for people purchasing the book, which has much more reference information available and which will be kept updated. Cloud computing brings a host of new challenges to those implementing it. It is no longer just the task of the IT manager to write the contract. Many other departments need to be involved from HR and security, to legal and financial and, as a result, many decisions taken to the highest level. Because of the complexities and diverse issues that cloud contracting encompasses, this is a must-have handbook for all those who need to succeed with cloud contracting. For more information, visit www.GTIBookstore.com.","details":{"authors":"Ron Scruggs, Thomas Trappler","format":"pdf","isbn-10":"1937246671","isbn-13":"978-1937246679","pages":"246 pages","publication date":"October 10, 2011","publisher":"Government Training Inc.","size":"1.00Mb"},"img":"http://23.95.221.108/covers/5f/5fbcf37a6e16e0e44dcedf58381ad70b.jpg","link":"https://rapidhosting.info/files/9hi","title":"Contracting for Cloud Services"}