{"categories":["Game Development","Manual"],"desc":" Develop your own 3D elearning game using gamification, systems design, and gameplay programming techniques About This Book Develop a game framework for a 3D eLearning game Program dynamic interactive actors and objects to populate your game world An easy-to-follow guide along with an extensive source code to support and guide readers through the concepts in the book Who This Book Is For This book is intended for novice game programmers with a little experience in Unity3D, who want to learn how to program eLearning games. Educators and trainers who want to use Unity in an eLearning setting will also benefit from the book. It would be helpful to have a basic understanding of the concepts such as Unity scripting and the Finite State Machine (FSM), but no prior experience in game development is required. What You Will Learn Create a user interface system for pop-ups and menus Develop a game framework that supports multiple scene files for multiple missions Design a system to handle objective and mission tracking in the game Implement an inventory system for the player to collect objects Create interactive objects to populate the game world Program Non-Player Characters to interact with the player Use a 3D camera, character and control systems for your game Design eLearning game missions to teach, test and reinforce learning In Detail Unity is a fully integrated development engine providing the required functionality to create games and interactive 3D content, while reducing the time, effort, and cost of developing the content. Nowadays, many people have started to use Unity in an eLearning setting as it allows them to create real-world scenarios, or models, for training purposes. With Unity, one can develop video games that are not only fun, but are also effective teaching and learning tools. When properly designed, an engaging game is an ideal platform for the presentation, testing, and application of learning","details":{"authors":"David Horachek","format":"pdf","isbn-10":"1849693420","isbn-13":"978-1849693424","pages":"250 pages","publication date":"May 6, 2014","publisher":"Packt Publishing - ebooks Account","size":"12.54Mb"},"img":"http://23.95.221.108/covers/37/37c83c11493041d6b78738bc5bab264d.jpg","link":"https://rapidhosting.info/files/c1u","title":"Creating eLearning Games with Unity"}