{"categories":["Security","Web Development"],"desc":" There is a new type of threat online that affects thousands of small businesses and millions of consumers worldwide, and yet 99% of them don’t even know about it. This cyber fraud is at your door, and you regularly invite these criminals into your home without even knowing it. In Cyber Fraud: The Web of Lies, cybersecurity expert Bryan Seely exposes a huge system of fraud that takes place online and the victims don’t even know it’s happening. Bryan Seely began his quest to expose this system of fraud in late 2013 and in February of 2014, demonstrated a flaw on Google Maps that these criminals use to commit these crimes. To prove his point, he Wiretapped the Secret Service in Washington, D.C. and the FBI in San Francisco. Yes, he actually intercepted calls to the Secret Service and FBI using Google Maps, a phone system, and some clever tricks. The day after, Seely walked into the Secret Service and told them about the problem. Initially the Secret Service agents were skeptical but Seely had another idea. Seely told the agents to call the DC office so he could prove it. The agent called the DC office, and after he hung up, Seely played back the conversation he just had, right from his laptop, with both voices on the recording. Seely was called a hero, and that is just the beginning of this incredible story. He has since been asked to speak at numerous events, including TEDx Kirkland, and is a regular expert on King 5 news in Seattle and other media outlets. He currently runs SeelySecurity.com and is a consumer privacy advocate as well as cyber security consultant.","details":{"authors":"Bryan Seely, Jonathan David Chicquette, Brian Muchinsky","format":"pdf","isbn-10":"1514273004","isbn-13":"978-1514273005","pages":"300 pages","publication date":"July 15, 2015","publisher":"Amazon","size":"2.00Mb"},"img":"http://23.95.221.108/covers/97/97a470f722abaeaea71e7cbb430a57a0.jpg","link":"https://rapidhosting.info/files/asf","title":"Cyber Fraud: The Web of Lies"}