{"categories":["Data Management","Databases"],"desc":" This book walks you through the practical usage of EJB 3.0 database persistence with Oracle Fusion Middleware. Lots of examples and a step-by-step approach make it a great way for EJB application developers to acquire new skills. Overview Integrate EJB 3.0 database persistence with Oracle Fusion Middleware tools: WebLogic Server, JDeveloper, and Enterprise Pack for Eclipse Automatically create EJB 3.0 entity beans from database tables Learn to wrap entity beans with session beans and create EJB 3.0 relationships Apply JSF and ADF Faces user interfaces (UIs) to EJB 3.0 database persistence A practical guide illustrated with examples to integrate EJB 3.0 database persistence with Ajax and Web Services What you will learn from this book Explore the new features in the EJB 3.0 specification Convert an EJB 2.0 entity bean to EJB 3.0 in JDeveloper Create EJB 3.0 entity beans from database tables automatically in JDeveloper Implement EJB 3.0 database persistence with JDeveloper, WebLogic Server, and Enterprise Pack for Eclipse Wrap an entity bean with a session bean Build a client for an EJB 3.0 entity bean application Develop an ADF Faces user interface (UI) for entity beans Create EJB 3.0 entity relationships Design JSF UIs for EJB 3.0 entity relationships Integrate EJB 3.0 database persistence with an AJAX user interface (UI) Build EJB 3.0 Web Services from entity beans Approach This is a practical, tutorial-style book that includes many examples that demonstrate how to develop EJB 3.0 database persistence applications with Oracle Fusion Middleware 11g. Every chapter starts with setting the environment for the chapter and includes an example application illustrated with figures at milestone stages. Who this book is written for This book is aimed at EJB 3.0 application developers who want to learn about the practical use of EJB 3.0 database persistence with Oracle Fusion Middleware. Those who are already using EJB 3.0","details":{"authors":"Deepak Vohra","format":"pdf","isbn-10":"1849681562","isbn-13":"978-1849681568","pages":"448 pages","publication date":"August 26, 2010","publisher":"Packt Publishing","size":"22.03Mb"},"img":"http://23.95.221.108/covers/9f/9f7c8f450b64a93bf14e7a575c8f9353.jpg","link":"https://rapidhosting.info/files/8v3","title":"EJB 3.0 Database Persistence with  Oracle Fusion Middleware 11g"}