{"categories":["Algorithms","Data Management","Engineering","Programming"],"desc":" Cluster analysis is an unsupervised process that divides a set of objects into homogeneous groups. This book starts with basic information on cluster analysis, including the classification of data and the corresponding similarity measures, followed by the presentation of over 50 clustering algorithms in groups according to some specific baseline methodologies such as hierarchical, center-based, and search-based methods. As a result, readers and users can easily identify an appropriate algorithm for their applications and compare novel ideas with existing results.   The book also provides examples of clustering applications to illustrate the advantages and shortcomings of different clustering architectures and algorithms. Application areas include pattern recognition, artificial intelligence, information technology, image processing, biology, psychology, and marketing. Readers also learn how to perform cluster analysis with the C/C++ and MATLAB® programming languages.  Audience The following groups will find this book a valuable tool and reference: applied statisticians; engineers and scientists using data analysis; researchers in pattern recognition, artificial intelligence, machine learning, and data mining; and applied mathematicians. Instructors can also use it as a textbook for an introductory course in cluster analysis or as source material for a graduate-level introduction to data mining.  Contents Preface; Chapter 1: Data Clustering; Chapter 2: Data Types; Chapter 3: Scale Conversion; Chapter 4: Data Standardizatin and Transformation; Chapter 5: Data Visualization; Chapter 6: Similarity and Dissimilarity Measures; Chapter 7: Hierarchical Clustering Techniques; Chapter 8: Fuzzy Clustering Algorithms; Chapter 9: Center Based Clustering Algorithms; Chapter 10: Search Based Clustering Algorithms; Chapter 11: Graph Based Clustering Algorithms; Chatper 12: Grid Based Clustering Algorithms; Chapter 13: Density Based Clustering Algorithms; Chapter 14: Model Based Clustering Algorithms; Chapter 15: Subspace Clustering; Chapter 16: Miscellaneous Algorithms; Chapter 17: Evaluation of Clustering Algorithms; Chapter 18: Clustering Gene Expression Data; Chapter 19: Data Clustering in MATLAB; Chapter 20: Clustering in C/C++; Appendix A: Some Clustering Algorithms; Appendix B: Thekd-tree Data Structure; Appendix C: MATLAB Codes; Appendix D: C++ Codes; Subject Index; Author Index","details":{"authors":"Chaoqun Ma, Jianhong Wu","format":"pdf","isbn-10":"0898716233","isbn-13":"978-0898716238","pages":"466 pages","publication date":"May 30, 2007","publisher":"SIAM, Society for Industrial and Applied Mathematics","size":"5.00Mb"},"img":"http://23.95.221.108/covers/ab/abe1200b2c37385d90203c92018134d1.jpg","link":"https://rapidhosting.info/files/8xl","title":"Data Clustering: Theory, Algorithms, and Applications (ASA-SIAM Series on Statistics and Applied Probability)"}