{"categories":["Designing","Engineering"],"desc":" This book describes two target applications for synchronous systems: regulated 3-phase voltage supply and voltage sag mitigation. It presents a detailed design procedure for converter switches and filters considering all steady-state, commutation and dynamic requirements. This work has evolved from previously published research by the authors, which in turn is part of a larger effort to expand the application domain of matrix converters to power systems. The objectives of the work have been categorized into the following: developing a dynamic model that provides adequate design insights; designing filters; and devising a control scheme. The low frequency dynamic model is first analyzed for regulated voltage supplies assuming balanced system. The system is modeled relative to a synchronous rotating (dq) frame linearized around an operating point. The input–output variables are related by non-diagonal transfer function matrices. Individual transfer function sub-matrices are sequentially investigated and it is shown that, depending on the input power, input voltage and filter parameters, the appearance of a set of right half zeros is possible.   The book then considers filter design, as well as general issues like ripple attenuation, regulation, reactive current loading, and filter losses. The book also addresses additional constraints that may be imposed by dynamic requirements and commutation. In the third stage, voltage controller design is detailed for a 3-phase regulated voltage supply. In dq domain, output voltage control represents a multivariable control problem. This is reduced to a single variable control problem while retaining all possible right half zeros, thereby preserving the internal stability of the system. Consequently, the standard single variable control design technique has been used to design a controller. The analytically predicted dynamic response has been verified by experimental results. It was possible to operate the system beyond the critical power boundary where the right half zeros emerge.  Lastly, the developed control approach has been extended to voltage sag mitigation with adequate modifications. A 3-wire linear load and  both symmetrical and asymmetrical voltage sags have been considered. Experimentally obtained response time for sag mitigation was found to be less than the power supply holdup time of most of the sensitive equipment. This book will be useful to both researchers and graduate students.","details":{"authors":"Anindya Dasgupta, Parthasarathi Sensarma","format":"pdf","isbn-10":"9811038295","isbn-13":"978-9811038297","pages":"124 pages","publication date":"March 30, 2017","publisher":"Springer","size":"5.00Mb"},"img":"http://23.95.221.108/covers/80/802ddf73ffe997f812523cff38387c05.jpg","link":"https://rapidhosting.info/files/bo2","title":"Design and Control of Matrix Converters: Regulated 3-Phase Power Supply and Voltage Sag Mitigation for Linear Loads (Energy Systems in Electrical Engineering)"}