{"categories":["Engineering","Image Processing"],"desc":" Digital Image Processing Using MATLAB is the first book to offer a balanced treatment of image processing fundamentals and the software principles used in their implementation. The book integrates material from the leading text, Digital Image Processing by Gonzalez and Woods, and the Image Processing Toolbox from The MathWorks, Inc., a leader in scientific computing. The Image Processing Toolbox provides a stable, well-supported software environment for addressing a broad range of applications in digital image processing. A unique feature of the book is its emphasis on showing how to enhance those tools by developing new code. This is important in image processing, an area that normally requires extensive experimental work in order to arrive at acceptable application solutions. Some Highlights: (1) This new edition is an extensive upgrade of the book. (2) Over 120 new MATLAB image processing functions are developed, a 40 % increase over existing functions in the Image Processing Toolbox. (3) Algorithms and MATLAB functions in the mainstream of digital image processing are discussed and implemented, including: Intensity transformations; spatial filtering; fuzzy image processing; filtering in the frequency domain; image restoration and reconstruction; geometric transformations and image registration; color image processing; wavelets; image and video compression; morphology; image segmentation; image representation and description; and object recognition. (4) In addition to a major revision of the topics from the first edition, features in this edition include new coverage of: The Radon transform; image processing functions based on function-generating functions (function factories); geometric transformations; image registration; color profiles and device-independent color conversions; functions for video compression; adaptive thresholding algorithms; new image features, including minimum-perimeter polygons and local (corner) features.","details":{"authors":"Richard E. Woods","format":"pdf","isbn-10":"0982085400","isbn-13":"978-0982085400","pages":"827 pages","publication date":"2009","publisher":"Gatesmark Publishing","size":"34.00Mb"},"img":"http://23.95.221.108/covers/0c/0c7ec99d109f7a2255e0bb1589664de5.jpg","link":"https://rapidhosting.info/files/9e2","title":"Digital Image Processing Using MATLAB, 2nd ed."}