{"categories":["Engineering","Networking"],"desc":" The area of detection and estimation in a distributed wireless sensor network (WSN) has several applications, including military surveillance, sustainability, health monitoring, and Internet of Things (IoT). Compared with a wired centralized sensor network, a distributed WSN has many advantages including scalability and robustness to sensor node failures. In this book, we address the problem of estimating the structure of distributed WSNs. First, we provide a literature review in: (a) graph theory; (b) network area estimation; and (c) existing consensus algorithms, including average consensus and max consensus. Second, a distributed algorithm for counting the total number of nodes in a wireless sensor network with noisy communication channels is introduced. Then, a distributed network degree distribution estimation (DNDD) algorithm is described. The DNDD algorithm is based on average consensus and in-network empirical mass function estimation. Finally, a fully distributed algorithm for estimating the center and the coverage region of a wireless sensor network is described. The algorithms introduced are appropriate for most connected distributed networks. The performance of the algorithms is analyzed theoretically, and simulations are performed and presented to validate the theoretical results. In this book, we also describe how the introduced algorithms can be used to learn global data information and the global data region.","details":{"authors":"Sai Zhang, Cihan Tepedelenlioglu, Andreas Spanias, Mahesh Banavar, William Tranter","format":"pdf","isbn-10":"1681732920","isbn-13":"978-1681732923","pages":"88 pages","publication date":"March 2, 2018","publisher":"Morgan & Claypool","size":"3.25Mb"},"img":"http://23.95.221.108/covers/ac/ac18998769312ca6d81bb763c3d6ed51.jpg","link":"https://rapidhosting.info/files/e6v","title":"Distributed Network Structure Estimation Using Consensus Methods (Synthesis Lectures on Communications)"}