{"categories":["Manual","Software"],"desc":" 80 hands-on recipes to efficiently work with the Docker 1.6 environment on Linux About This Book Provides practical techniques and knowledge of various emerging and developing APIs to help you create scalable services Create, manage, and automate production-quality services while dealing with inherent issues. Each recipe is carefully organized with instructions to complete the task efficiently Who This Book Is For Docker Cookbook is for developers, system administrators, and DevOps engineers who want to use Docker in his/her development, QA, or production environments. It is expected that the reader has basic Linux/Unix skills such as installing packages, editing files, managing services, and so on. Any experience in virtualization technologies such as KVM, XEN, and VMware will help the reader to relate with container technologies better, but it is not required. What You Will Learn Install and set up Docker on different environments Work with Docker images and containers to Dockerize applications Create services with Docker to enable the swift development and deployment of applications Make optimum use of Docker in a testing environment do complete CI/CD Plan efficient working with Docker APIs, orchestration, and hosting platform such as Project Atomic Learn the various use cases available for Docker Troubleshoot, maintain, and optimize your Docker services effectively In Detail Docker is a Linux container engine that allows you to create consistent, stable, and production-quality environments with containers. You will start by installing Docker and understanding and working with containers and images. You then proceed to learn about network and data management for containers. The book explores the RESTful APIs provided by Docker to perform different actions such as image/container operations. Finally, the book explores logs and troubleshooting Docker to solve issues and bottlenecks. This book will also help you","details":{"authors":"Neependra Khare","format":"pdf","isbn-10":"1783984864","isbn-13":"978-1783984862","pages":"248 pages","publication date":"June 11, 2015","publisher":"Packt Publishing","size":"4.00Mb"},"img":"http://23.95.221.108/covers/2f/2fede0b75b1c9e08201432e4caad9278.jpg","link":"https://rapidhosting.info/files/dd0","title":"Docker Cookbook"}