{"categories":["Engineering","Manual"],"desc":" Updated with new case studies and content, the fully revised Third Edition of Essentials of Software Engineering offers a comprehensive, accessible, and concise introduction to core topics and methodologies of software development. Designed for undergraduate students in introductory courses, the text covers all essential topics emphasized by the IEEE Computer Society-sponsored Software Engineering Body of Knowledge (SWEBOK). In-depth coverage of key issues, combined with a strong focus on software quality, makes Essentials of Software Engineering, Third Edition the perfect text for students entering the fast-growing and lucrative field of software development. The text includes thorough overviews of programming concepts, system analysis and design, principles of software engineering, development and support processes, methodologies, and product management.  The revised and updated Third Edition includes all-new sections on SCRUM and HTML-Script-SQL Design Examples, as well as expanded discussions of User-Interface Design, Flow of Interactions, Cognitive Models, and other UI Design issues. Covering all phases of the software production lifecycle and emphasizing quality throughout, Essentials of Software Engineering is a superb resource for students of software engineering.  Key Features: • Revised and fully updated throughout, with all-new sections on SCRUM and HTML-Script-SQL Design Examples, as well as expanded discussions of other central topics • Provides coverage of all essential topics emphasized by SWEBOK • Covers essential topics required for students to complete individual and team projects in an affordable and accessible paperback format. • Contains an all-new Appendix with examples of Essential Software Development Plan (SDP), Essential Software Requirements Specifications (SRS), Essential Software Design, and Essential Test Plan • Accompanied by a full suite of instructor support material, including answers to the end-of-chapter questions, PowerPoint Lecture Outlines, and a complete Test Bank","details":{"authors":"Frank Tsui","format":"pdf","isbn-10":"1449691994","isbn-13":"978-1449691998","pages":"334 pages","publication date":"February 21, 2013","publisher":"Jones & Bartlett Learning","size":"33.00Mb"},"img":"http://23.95.221.108/covers/ee/ee861fa4eefe834318012c1a8fa1aecb.jpg","link":"https://rapidhosting.info/files/czn","title":"Essentials Of Software Engineering"}