{"categories":["Algorithms","Engineering","Programming"],"desc":" Motion estimation is a long-standing cornerstone of image and video processing. Most notably, motion estimation serves as the foundation for many of today’s ubiquitous video coding standards including H.264. Motion estimators also play key roles in countless other applications that serve the consumer, industrial, biomedical, and military sectors. Of the many available motion estimation techniques, optical flow is widely regarded as most flexible. The flexibility offered by optical flow is particularly useful for complex registration and interpolation problems, but comes at a considerable computational expense. As the volume and dimensionality of data that motion estimators are applied to continue to grow, that expense becomes more and more costly. Control grid motion estimators based on optical flow can accomplish motion estimation with flexibility similar to pure optical flow, but at a fraction of the computational expense. Control grid methods also offer the added benefit of representing motion far more compactly than pure optical flow. This booklet explores control grid motion estimation and provides implementations of the approach that apply to data of multiple dimensionalities. Important current applications of control grid methods including registration and interpolation are also developed. Table of Contents: Introduction / Control Grid Interpolation (CGI) / Application of CGI to Registration Problems / Application of CGI to Interpolation Problems / Discussion and Conclusions","details":{"authors":"Christine M. Zwart, David H. Frakes","format":"pdf","isbn-10":"1627051295","isbn-13":"978-1627051293","pages":"88 pages","publication date":"January 16, 2013","publisher":"Morgan & Claypool Publishers","size":"2.00Mb"},"img":"http://23.95.221.108/covers/58/585d0e4cc70b8abb1dc4e555cfc286d3.jpg","link":"https://rapidhosting.info/files/dfw","title":"Control Grid Motion Estimation for Efficient Application of Optical Flow (Synthesis Lectures on Algorithms and Software in Engineering)"}