{"categories":["Management"],"desc":" The book is written in a straightforward style and avoids sales and marketing hype. William J. Carpenter is an Enterprise Content Management architect at IBM who spends every day doing product development and helping others make the best use of the Content Manager product. The numerous tips and notes arise from his years of practical experience with FileNet products. Most of the book consists of specific recipes for installing and using Content Manager, and it also provides you with clear and precise explanations of the most important features and components. It is written in a conversational style without being “dumbed down”, and the book can be read straight through, from cover to cover. It emphasizes the things you need to know, presented in a logical progression. If you are a CIO, an IT manager, an IT staff engineer, or perhaps a business leader, business analyst, or even an end user who wants to better understand the role that Content Manager plays in your enterprise, irrespective of any previous knowledge of IBM FileNet P8 Content Manager or Enterprise Content Management in general, then this book is a must have for you. And if you are someone who is just starting to work with Content Manager or who is facing a decision about whether to use Content Manager or another solution, be assured you will not find a better guide. Even if you have years of experience, you can still enrich your knowledge with the clear, practical explanations of basic and advanced features. Although it is not a developer’s guide, per se, the API and sample application will help you as an enterprise developer or architect to get your bearings in Content Manager technologies.","details":{"authors":"William J. Carpenter","format":"pdf","isbn-10":"1849680701","isbn-13":"978-1849680707","pages":"452 pages","publication date":"February 21, 2011","publisher":"Packt Publishing","size":"4.00Mb"},"img":"http://23.95.221.108/covers/22/2295191c450a0c86b2d82df6cec04526.jpg","link":"https://rapidhosting.info/files/grk","title":"Getting Started with IBM FileNet P8 Content Manager"}