{"categories":["Engineering","Security"],"desc":" The approach to research in global security from the perspective of the human sciences presents a number of challenges. NATO and ESF, aware of the importance of this endeavor, have commissioned lInstitut Francais dAnalyse Strategique (IFAS) to organize a number of activities aimed at identifying potential areas for research. This book presents the findings of these investigations. Whilst the human sciences will of course continue their traditional activities and research, the intention is to establish an additional security oriented sector for the new generation, to which each discipline will contribute knowledge and specific methodologies to achieve an innovative cross discipline approach: history, geography, ethnology and psychology will interact with sociology, anthropology, philosophy and many other disciplines; together under the umbrella of security. Since the end of the Cold War, the predominantly military security focus has been extended to include an interaction between individual and global spheres: the individual dimension (human security) and the planet dimension, as well as the related perception of connections between mankind and a fragile environment. This book takes into account the basic principles and the variables which must be considered to enable organizations worldwide, such as the EU, NATO, ASEAN (Association of South East Asian Nations) and SCO (Shanghai Corporation Organization) to work together and to define areas of research for all institutes, think tanks and individuals willing to integrate into the extended security research network which is already being built.","details":{"authors":"F. Gere and M. Sharpe","format":"pdf","isbn-10":"1607507595","isbn-13":"978-1607507598","pages":"196 pages","publication date":"July 15, 2011","publisher":"IOS Press","size":"2.00Mb"},"img":"http://23.95.221.108/covers/7b/7b27e0536ec21169b0c829608d7fcedd.jpg","link":"https://rapidhosting.info/files/abk","title":"Global Security: A Vision for the Future — Addressing the Challenges and Opportunities for Research in the Information Age (NATO Science for Peace and Security)"}