{"categories":["Software","Sysadmin","Web Development"],"desc":" As an application designer or developer, imagine a world where you don’t have to worry about authentication. Imagine instead that all requests to your application already include the information you need to make access control decisions and to personalize the application for the user. In this world, your applications can trust another system component to securely provide user information, such as the user’s name or e-mail address, a manager’s e-mail address, or even a purchasing authorization limit. The user’s information always arrives in the same simple format, regardless of the authentication mechanism, whether it’s Microsoft Windows integrated authentication, forms-based authentication in a Web browser, an X.509 client certificate, Windows Azure Access Control Service, or something more exotic. Even if someone in charge of your company’s security policy changes how users authenticate, you still get the information, and it’s always in the same format. This is the utopia of claims-based identity that A Guide to Claims-Based Identity and Access Control describes. As you’ll see, claims provide an innovative approach for building applications that authenticate and authorize users. This book gives you enough information to evaluate claims-based identity as a possible option when you’re planning a new application or making changes to an existing one. It is intended for any architect, developer, or information technology (IT) professional who designs, builds, or operates web applications, web services, or SharePoint applications that require identity information about their users.","details":{"authors":"Dominick Baier, Vittorio Bertocci, Keith Brown, Scott Densmore, Eugenio Pace, Matias Woloski","format":"pdf","isbn-10":"1621140024","isbn-13":"978-1621140023","pages":"410 pages","publication date":"March 16, 2013","publisher":"Microsoft patterns & practices","size":"19.00Mb"},"img":"http://23.95.221.108/covers/54/5481e9bf3c544380d7c7bd7472cde5ed.jpg","link":"https://rapidhosting.info/files/bkh","title":"A Guide to Claims-Based Identity and Access Control: Authentication and Authorization for Services and the Web (Microsoft patterns & practices)"}