{"categories":["Databases","Manual","Web Development"],"desc":" There’s more than one way to achieve high availability for MySQL and this Cookbook covers a range of techniques and tools in over 60 practical recipes. The only book of its kind, you’ll be learning the natural, engaging way. Overview Analyze and learn different high availability options, including clustering and replication solutions within MySQL Improve uptime of your MySQL databases with simple recipes showing powerful high availability techniques for MySQL Tune your MySQL database for optimal performance. The only complete, practical, book of MySQL high availability techniques and tools on the market Part of Packt’s Cookbook series: Each recipe is a carefully organized sequence of instructions to complete the task as efficiently as possible What you will learn from this book Configure a MySQL Cluster for scaling out MySQL Learn the technique of taking online backups and recovery Achieve high availability with MySQL Replication and various tools such as the open source Multi-Master Replication Manager (MMM) and Flipper projects Configure a MySQL replication design to replicate data from one MySQL database server to one or more other MySQL database servers Master the safety tricks of replication to prevent replication failure Configure a MySQL service to work using a shared storage device to achieve high availability, with and without a clustered filesystem Learn to use the open source Global File System (GFS) to have the same file system on more than one node Achieve high availability using block level replication with Distributed Replicated Block Device (DRBD) Improve your system’s performance with the technique of performance tuning Approach This book uses the approach of a cookbook. Each recipe provides the reader with easy step-by-step descriptions of the actions necessary to accomplish a specific task. It is designed to present what often appear as extremely complicated techniques as a series of simple-to","details":{"authors":"Alex Davies","format":"pdf","isbn-10":"1847199941","isbn-13":"978-1847199942","pages":"276 pages","publication date":"April 27, 2010","publisher":"Packt Publishing","size":"2.41Mb"},"img":"http://23.95.221.108/covers/ca/ca033f57fe16b6396ea91d0d96350117.jpg","link":"https://rapidhosting.info/files/f7s","title":"High Availability MySQL Cookbook"}