{"categories":["Programming"],"desc":" Implementing Models of Financial Derivatives is a comprehensive treatment of advanced implementation techniques in VBA for models of financial derivatives. Aimed at readers who are already familiar with the basics of VBA it emphasizes a fully object oriented approach to valuation applications, chiefly in the context of Monte Carlo simulation but also more broadly for lattice and PDE methods. Its unique approach to valuation, emphasizing effective implementation from both the numerical and the computational perspectives makes it an invaluable resource. The book comes with a library of almost a hundred Excel spreadsheets containing implementations of all the methods and models it investigates, including a large number of useful utility procedures. Exercises structured around four application streams supplement the exposition in each chapter, taking the reader from basic procedural level programming up to high level object oriented implementations. Written in eight parts, parts 1-4 emphasize application design in VBA, focused around the development of a plain Monte Carlo application. Part 5 assesses the performance of VBA for this application, and the final 3 emphasize the implementation of a fast and accurate Monte Carlo method for option valuation. Key topics include: ?Fully polymorphic factories in VBA; ?Polymorphic input and output using the TextStream and FileSystemObject objects; ?Valuing a book of options; ?Detailed assessment of the performance of VBA data structures; ?Theory, implementation, and comparison of the main Monte Carlo variance reduction methods; ?Assessment of discretization methods and their application to option valuation in models like CIR and Heston; ?Fast valuation of Bermudan options by Monte Carlo. Fundamental theory and implementations of lattice and PDE methods are presented in appendices and developed through the book in the exercise streams. Spanning the two worlds of academic theory and industrial practice, this book is not only suitable as a classroom text in VBA, in simulation methods, and as an introduction to object oriented design, it is also a reference for model implementers and quants working alongside derivatives groups. Its implementations are a valuable resource for students, teachers and developers alike. Note: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.","details":{"authors":"Nick Webber","format":"pdf","isbn-10":"0470712201","isbn-13":"978-0470712207","pages":"696 pages","publication date":"March 21, 2011","publisher":"Wiley","size":"3.59Mb"},"img":"http://23.95.221.108/covers/20/20543bc3865bcf16e1814e749401aed3.jpg","link":"https://rapidhosting.info/files/eid","title":"Implementing Models of Financial Derivatives, with CD-ROM: Object Oriented Applications with VBA"}