{"categories":["Manual","Mobile Development","Web Development"],"desc":" This book explores theoretical and practical aspects of implementing mobile language learning in university classrooms for English as a Foreign Language in Japan. The technologies utilized, such as smartphones, iPads, and wi-fi, integrate students’ hand-held devices into the campus network infrastructure. The pedagogical aims of ubiquitous mobile learning further incorporate social media, blended learning, and flipped classroom approaches into the curriculum. Chapter 1 defines mobile language learning within dimensions of e-learning and technology-assisted language learning, prior to tracing the development of mobile learning in Japan. Chapter 2 documents the sociocultural theory underpinning the authors’ humanistic approach to implementation of mobile technologies. The sociocultural pedagogy represents a global consensus of leading educators that also recognizes the agency of Asian learners and brings out their capability for autonomous learning. Case studies of universities, large and small, public and private, are organized similarly in Chapters 3 to 5. Institutional/pedagogical and technological context sections are followed by detailed content on the implementation of initiatives, assessment of effectiveness, and recommendations for other institutions. Distinct from a collection of papers, this monograph tells a story in brief book length about theorizing and realizing mobile language learning, describing pioneering and original initiatives of importance to practitioners in other educational contexts.","details":{"authors":"Steve McCarty, Hiroyuki Obari, Takeshi Sato","format":"pdf","isbn-10":"9811024499","isbn-13":"978-9811024498","pages":"97 pages","publication date":"October 7, 2016","publisher":"Springer","size":"2.00Mb"},"img":"http://23.95.221.108/covers/37/37d759cc4fc386816f521ee5ac047e68.jpg","link":"https://rapidhosting.info/files/gka","title":"Implementing Mobile Language Learning Technologies in Japan (SpringerBriefs in Education)"}