{"categories":["Designing","Engineering"],"desc":" Information Architecture is about organizing and simplifying information, designing and integrating information spaces/systems, and creating ways for people to find and interact with information content. Its goal is to help people understand and manage information and make right decisions accordingly. In the ever-changing social, organizational and technological contexts, Information Architects not only design individual information spaces (e.g., individual websites, software applications, and mobile devices), but also tackle strategic aggregation and integration of multiple information spaces across websites, channels, modalities, and platforms. Not only they create predetermined navigation pathways, but also provide tools and rules for people to organize information on their own and get connected with others. Information Architects work with multi-disciplinary teams to determine the user experience strategy based on user needs and business goals, and make sure the strategy gets carried out by following the user-centered design (UCD) process via close collaboration with others. Drawing on the author(s) extensive experience as HCI researchers, User Experience Design practitioner, and Information Architecture instructors, this book provides a balanced view of the IA discipline by applying the IA theories, design principles and guidelines to the IA and UX practices. It also covers advanced topics such as Enterprise IA, Global IA, and Mobile IA. In addition to new and experienced IA practitioners, this book is written for undergraduate and graduate level students in Information Architecture, Information Sciences, Human Computer Interaction, Information Systems and related disciplines.","details":{"authors":"Wei Ding, Xia Lin","format":"pdf","isbn-10":"159829959X","isbn-13":"978-1598299595","pages":"172 pages","publication date":"November 12, 2009","publisher":"Morgan and Claypool Publishers","size":"2.00Mb"},"img":"http://23.95.221.108/covers/df/dfa579e04971dbf6ed8c474fc0be0799.jpg","link":"https://rapidhosting.info/files/9pk","title":"Information Architecture: The Design and Integration of Information Spaces (Synthesis Lectures on Information Concepts, Retrieval, and S)"}