{"categories":["Digital Design/Media","Manual","Software"],"desc":" 109 recipes to create scalable vector graphics with Inkscape Create interesting illustrations and common web design elements that can be used in real-life projects Gain a thorough understanding of all common Inkscape tools and advanced features of Inkscape 0.48 Tips and tricks to speed up your drawing workflow Part of Packt’s Cookbook series: Each recipe is a carefully organized sequence of instructions to complete the task as efficiently as possible In Detail Inkscape is an open source vector graphics editor with an intuitive user interface that has enough depth to make quality graphic designs with an attractive layout comparable to what you would make using Illustrator or CorelDraw. But choosing the right tool and the best approach to creating the desired effect can be challenging. Inkscape 0.48 Illustrator’s Cookbook makes it super-easy for you to make your own vector-based graphics with the powerful Inkscape editor. Inkscape 0.48 Illustrator’s Cookbook provides you with the latest recipes to quickly create scalable vector graphics. Recipes in this book teach you about some of the most useful time-saving features in Inkscape accompanied by a list of keyboard shortcuts that you can easily memorize. In addition to covering use of Inkscape tools and their advanced features, examples from the recipes uncover solutions to common graphics problems. The book starts off with familiarizing you with the tools and techniques in Inkscape that you can use to draw 2D shapes, calligraphic shapes, and 3D boxes easily. It then guides you through the most common color-changing steps performed in Inkscape along with some convenient procedures that can save your time when dealing with colors. It explains drawing using linear and radial gradients, which are irreplaceable, usage of clones to create interesting effects in illustrations, and live-path effects that can help you speed up constructing a shape and make the process more natur","details":{"authors":"Mihaela Jurkovic, Rigel Di Scala","format":"pdf","isbn-10":"1849512663","isbn-13":"978-1849512664","pages":"340 pages","publication date":"April 26, 2011","publisher":"Packt Publishing","size":"8.00Mb"},"img":"http://23.95.221.108/covers/8b/8bd5d277398345f10b3195ca00a0ef12.jpg","link":"https://rapidhosting.info/files/7sr","title":"Inkscape 0.48 Illustrator’s Cookbook"}