{"categories":["Designing","Web Development"],"desc":" An approachable introduction to web design in jQuery for non- programmers Enhance the user experience of your site by adding useful jQuery features Learn the basics of adding impressive jQuery effects and animations even if you’ve never written a line of JavaScript Easy step-by-step approach shows you everything you need to know to get started improving your website with jQuery In Detail jQuery is awesome for designers – it builds easily on the CSS and HTML you already know and allows you to create impressive effects with just a few lines of code. However, without a background in programming, JavaScript – on which jQuery is built – can feel intimidating and impossible to grasp. This book will show you how simple it can be to learn the basics and then extend your capabilities by taking advantage of jQuery plugins. jQuery for Designers offers approachable lessons for designers with little or no background in JavaScript. The book begins by introducing the jQuery library and a small and simple introduction to JavaScript. Then you’ll step through a few simple tasks to get your feet wet before diving into using plugins to quickly and simply add complex effects with just a few lines of code. You’ll be surprised at how far you can get with JavaScript when you start with the power of the jQuery library and this book will show you how. We’ll cover common interface widgets and effects such as tabbed interfaces, custom tooltips, and custom scrollbars. You’ll learn how to create an animated navigation menu and how to add simple AJAX effects to enhance your site visitors experience. Then we’ll wrap up with interactive data grids which make sorting and searching data easy. What you will learn from this book Download and include the jQuery library on your website Build browsable photo galleries and animated slideshows, along with carousels and sliders Create tabbed interfaces in a few lines of code without a plugin Include custom scrollbars th","details":{"authors":"Natalie MacLees","format":"pdf","isbn-10":"1849516707","isbn-13":"978-1849516709","pages":"332 pages","publication date":"April 25, 2012","publisher":"Packt Publishing","size":"11.22Mb"},"img":"http://23.95.221.108/covers/4f/4f268ac74daf46c738012663886348e2.jpg","link":"https://rapidhosting.info/files/g9m","title":"jQuery for Designers: Beginner’s Guide"}