{"categories":["Engineering"],"desc":" LaTex is a software system for typesetting documents. Because it is especially good for technical documents and is available for almost any computer system, LaTex has become a lingua franca of the scientific world. Researchers, educators, and students in universities, as well as scientists in industry, use LaTex to produce professionally formatted papers, proposals, and books. They also use LaTex input to communicate information electronically to their colleagues around the world. With the release of LaTex 2[subscript epsilon], the new standard version, LaTex has become even more powerful. Among its new features are an improved method for handling different styles of type, and commands for including graphics and producing colors. LaTex 2[subscript epsilon] makes available to all LaTex users valuable enhancements to the software that have been developed over the years by users in many different places to satisfy a variety of needs. This book, written by the original architect and implementer of LaTex is both the user’s guide and the reference manual for the software. It has been updated to reflect the changes in the new release. The book begins with instructions for formatting simpler text, and progressively describes commands and techniques for handling larger and more complicated documents. A separate chapter explains how to deal with errors. An added appendix describes what is new and different in LaTex 2[subscript epsilon]. Other additions to the second edition include descriptions of new commands for inserting pictures prepared with other programs and for producing colored output; new sections on how to make books and slides; instructions for making an index with the MakeIndexprogram, and an updated guide to preparing a bibliography with the BibTex program; plus a section on how to send your LaTex documents electronically. Users new to LaTex will find here a book that has earned worldwide praise as a model for clear, concise, and practical documentation. E","details":{"authors":"Leslie Lamport","format":"pdf","isbn-10":"0201529831","isbn-13":"978-0201529838","pages":"288 pages","publication date":"July 10, 1994","publisher":"Addison-Wesley Professional","size":"1.00Mb"},"img":"http://23.95.221.108/covers/79/792766eeffab8a6d4dd47f08ef2f1f62.jpg","link":"https://rapidhosting.info/files/9ol","title":"LaTeX: A Document Preparation System (2nd Edition)"}