{"categories":["Engineering"],"desc":" When there’s a scientific or technical paper to write, the versatility of LaTeX is very attractive. But where can you learn about the software? The answer is this superb beginner’s guide, packed with examples and explanations. Overview Use LaTeX’s powerful features to produce professionally designed texts Install LaTeX; download, set up, and use additional styles, templates, and tools Typeset math formulas and scientific expressions to the highest standards Include graphics and work with figures and tables Benefit from professional fonts and modern PDF features In Detail LaTeX is high-quality Open Source typesetting software that produces professional prints and PDF files. However, as LaTeX is a powerful and complex tool, getting started can be intimidating. There is no official support and certain aspects such as layout modifications can seem rather complicated. It may seem more straightforward to use Word or other WYSIWG programs, but once you’ve become acquainted, LaTeX’s capabilities far outweigh any initial difficulties. This book guides you through these challenges and makes beginning with LaTeX easy. If you are writing Mathematical, Scientific, or Business papers, or have a thesis to write, then this is the perfect book for you. LaTeX Beginner’s Guide offers you a practical introduction to LaTeX with plenty of step-by-step examples. Beginning with the installation and basic usage, you will learn to typeset documents containing tables, figures, formulas, and common book elements like bibliographies, glossaries, and indexes and go on to managing complex documents and using modern PDF features. It’s easy to use LaTeX, when you have LaTeX Beginner’s Guide to hand. This practical book will guide you through the essential steps of LaTeX, from installing LaTeX, formatting, and justification to page design. Right from the beginning, you will learn to use macros and styles to maintain a consistent document structure","details":{"authors":"Stefan Kottwitz","format":"pdf","isbn-10":"1847199860","isbn-13":"978-1847199867","pages":"336 pages","publication date":"March 21, 2011","publisher":"Packt Publishing","size":"5.00Mb"},"img":"http://23.95.221.108/covers/0c/0c4186709460b294ac2ffef49ec1c76c.jpg","link":"https://rapidhosting.info/files/agb","title":"LaTeX Beginner’s Guide"}