{"categories":["Manual","Mobile Development"],"desc":" Learn how to set up Nagios 4 in order to monitor your systems efficiently About This Book Set up, configure, and manage Nagios 4 to secure and monitor your system Learn how to use libnagios and NERD to process and handle queries Packed with lots of tips, tricks and illustrations to explain the Nagios configuration and monitoring concepts in a simplified manner Who This Book Is For This book is great for system administrators interested in using Nagios to monitor their systems. It will also help professionals who have already worked with earlier versions of Nagios to understand the new features of Nagios 4 and provides usable solutions to real-life problems related to Nagios administration. To effectively use this book, system administration knowledge is required. If you want to create your own plug-ins, knowledge of scripting languages like Perl, shell and Python is expected. What You Will Learn Install and configure Nagios to administer your network and system Deploy agents and plug-ins, and monitor assets with advanced features of Nagios Notify users of current and future incidents to protect the availability, performance, and security of monitored assets Configure and work your way around the Nagios web interface Pass service and host check results over the network using NSCA Set up a working and usable distributed monitoring system using NSClient++ Develop custom plug-ins responsible for performing checks and analyzing results Use the web interface to manage scheduled downtimes for hosts and services Implement adaptive monitoring to modify various check-related parameters Make use of SSH and NRPE to perform remote checks Use SNMP to retrieve information from a device, set options, and also cover means for a device to notify other machines about a failure In Detail One of the most important challenges in system monitoring is to detect and report any malfunctioning system or device as soon as possible,","details":{"authors":"Wojciech Kocjan","format":"pdf","isbn-10":"1783288647","isbn-13":"978-1783288649","pages":"390 pages","publication date":"March 25, 2014","publisher":"Packt Publishing - ebooks Account","size":"27.06Mb"},"img":"http://23.95.221.108/covers/6c/6c17955417d170ee8e7eddbc8448a9d2.jpg","link":"https://rapidhosting.info/files/9f9","title":"Learning Nagios 4"}