{"categories":["Machine Learning","Manual","Networking"],"desc":" This book presents the features and advantages offered by complex networks in the machine learning domain. In the first part, an overview on complex networks and network-based machine learning is presented, offering necessary background material. In the second part, we describe in details some specific techniques based on complex networks for supervised, non-supervised, and semi-supervised learning. Particularly, a stochastic particle competition technique for both non-supervised and semi-supervised learning using a stochastic nonlinear dynamical system is described in details. Moreover, an analytical analysis is supplied, which enables one to predict the behavior of the proposed technique. In addition, data reliability issues are explored in semi-supervised learning. Such matter has practical importance and is not often found in the literature. With the goal of validating these techniques for solving real problems, simulations on broadly accepted databases are conducted. Still in this book, we present a hybrid supervised classification technique that combines both low and high orders of learning. The low level term can be implemented by any classification technique, while the high level term is realized by the extraction of features of the underlying network constructed from the input data. Thus, the former classifies the test instances by their physical features, while the latter measures the compliance of the test instances with the pattern formation of the data. We show that the high level technique can realize classification according to the semantic meaning of the data. This book intends to combine two widely studied research areas, machine learning and complex networks, which in turn will generate broad interests to scientific community, mainly to computer science and engineering areas.","details":{"authors":"Thiago Christiano Silva, Liang Zhao","format":"epub","isbn-10":"3319172891","isbn-13":"978-3319172897","pages":"331 pages","publication date":"January 29, 2016","publisher":"Springer","size":"4.42Mb"},"img":"http://23.95.221.108/covers/e2/e2845d072f3d9ee9902380c8e56cc26e.jpg","link":"https://rapidhosting.info/files/h0n","title":"Machine Learning in Complex Networks"}