{"categories":["Machine Learning","Manual"],"desc":" Practical, hands-on solutions in Python to overcome any problem in Machine Learning Key Features Master the advanced concepts, methodologies, and use cases of machine learning Build ML applications for analytics, NLP and computer vision domains Solve the most common problems in building machine learning models Book DescriptionMachine learning (ML) helps you find hidden insights from your data without the need for explicit programming. This book is your key to solving any kind of ML problem you might come across in your job. You’ll encounter a set of simple to complex problems while building ML models, and you’ll not only resolve these problems, but you’ll also learn how to build projects based on each problem, with a practical approach and easy-to-follow examples. The book includes a wide range of applications: from analytics and NLP, to computer vision domains. Some of the applications you will be working on include stock price prediction, a recommendation engine, building a chat-bot, a facial expression recognition system, and many more. The problem examples we cover include identifying the right algorithm for your dataset and use cases, creating and labeling datasets, getting enough clean data to carry out processing, identifying outliers, overftting datasets, hyperparameter tuning, and more. Here, you’ll also learn to make more timely and accurate predictions. In addition, you’ll deal with more advanced use cases, such as building a gaming bot, building an extractive summarization tool for medical documents, and you’ll also tackle the problems faced while building an ML model. By the end of this book, you’ll be able to fine-tune your models as per your needs to deliver maximum productivity. What you will learn Select the right algorithm to derive the best solution in ML domains Perform predictive analysis effciently using ML algorithms Predict stock prices using the stock index value Perform customer analytics for an e-commerce platform Build recommendation engines for various domains Build NLP applications for the health domain Build language generation applications using different NLP techniques Build computer vision applications such as facial emotion recognition Who this book is forThis book is for the intermediate users such as machine learning engineers, data engineers, data scientists, and more, who want to solve simple to complex machine learning problems in their day-to-day work and build powerful and efficient machine learning models. A basic understanding of the machine learning concepts and some experience with Python programming is all you need to get started with this book.","details":{"authors":null,"format":"epub","isbn-10":"1788390040","isbn-13":"978-1788390040","pages":"566 pages","publication date":"April 26, 2018","publisher":"Packt Publishing","size":"69.75Mb"},"img":"http://23.95.221.108/covers/7f/7f8bb2d6a90f73c7e6c46baf463ab5d9.jpg","link":"https://rapidhosting.info/files/h9h","title":"Machine Learning Solutions"}