{"categories":["SEO"],"desc":" Marketing Strategy and Competitive Positioning 6e deals with the process of developing and implementing a marketing strategy. The book focuses on competitive positioning at the heart of marketing strategy and includes in-depth discussion of the processes used in marketing to achieve competitive advantage. The book is primarily about creating and sustaining superior performance in the marketplace. It focuses on the two central issues in marketing strategy formulation – the identification of target markets and the creation of a differential advantage. In doing that, it recognises the emergence of new potential target markets born of the recession and increased concern for climate change; and it examines ways in which firms can differentiate their offerings through the recognition of environmental and social concerns. New to this editionUpdated to reflect the on-going global economic crisis and its impact on business and marketing.  New coverage including the impact of emerging market on innovation, the perverse customer as a market force, the new realities in competing through services and market analysis and segmentation.  Updated chapters on strategic customer management and strategic alliances.  Increased emphasis on competing through innovation including new business models such as Uber, Netflix and new types of retailing.  Updates vignettes at the beginning of chapters focusing on companies such as Amadeus, Mastercard and Samsung Pay and including discussion questions.  New cases throughout the book including Ryanair, Amazon and Lego.  Up-dated online resources include an Instructor’s Manual and PowerPoint slides for instructors, along with additional case studies for students. The book is ideal for undergraduate and postgraduate students taking modules in Marketing Strategy, Marketing Management and Strategic Marketing Management.   Graham Hooley is Emeritus Professor of Marketing at Aston University. He is a past President of the European Marketing Academy, Fellow of the Chartered Institute of Marketing, British Academy of Management, EMAC and the Higher Education Academy.  Brigitte Nicoulaud is Senior Teaching Fellow at Aston Business School.  Nigel F. Piercy was previously Professor of Marketing & Strategic Management & Associate Dean at Warwick Business School, Warwick University. John M Rudd is a Professor of Marketing and Head of the Marketing Group at Warwick Business School.","details":{"authors":"Graham J. Hooley, Nigel F. Piercy, Brigitte Nicoulaud, John Rudd","format":"pdf","isbn-10":"1292017317","isbn-13":"978-1292017310","pages":"584 pages","publication date":"January 20, 2017","publisher":"Pearson Education Limited","size":"13.00Mb"},"img":"http://23.95.221.108/covers/14/14cfed597d64562bce72a0c499554cee.jpg","link":"https://rapidhosting.info/files/d7f","title":"Marketing Strategy and Competitive Positioning"}