{"categories":["Manual","Web Development"],"desc":" Delivers absolutely everything you will ever need to know to become a master Django programmer About This Book Gain a complete understanding of Django-the most popular, Python-based web framework in the world Gain the skills to successfully designing, developing, and deploying your app This book is packaged with fully described code so you can learn the fundamentals and the advanced topics to get a complete understanding of all of Django’s core functions Who This Book Is For This book assumes you have a basic understanding of the Internet and programming. Experience with Python or Django would be an advantage, but is not necessary. It is ideal for beginner to intermediate programmers looking for a fast, secure, scalable, and maintainable alternative web development platform to those based on PHP, Java, and dotNET. What You Will Learn Use Django to access user-submitted form data, validate it, and work with it Get to know advanced URLconf tips and tricks Extend Django’s template system with custom code Define models and use the database API to create, retrieve, update, and delete records Fully extend and customize the default implementation as per your project’s needs Test and deploy your Django application Get to know more about Django’s session, cache Framework, and middleware In Detail Mastering Django: Core is a completely revised and updated version of the original Django Book, written by Adrian Holovaty and Jacob Kaplan-Moss – the creators of Django. The main goal of this book is to make you a Django expert. By reading this book, you’ll learn the skills needed to develop powerful websites quickly, with code that is clean and easy to maintain. This book is also a programmer’s manual that provides complete coverage of the current Long Term Support (LTS) version of Django. For developers creating applications for commercial and business critical deployments, Mastering Django: Core provides a complete, up-to-date resource for Django 1.8LTS with a stable code-base, security fixes and support out to 2018. Style and approach This comprehensive step-by-step practical guide offers a thorough understanding of all the web development concepts related to Django. In addition to explaining the features of Django, this book provides real-world experience on how these features fit together to build extraordinary apps.”","details":{"authors":"Nigel George","format":"pdf","isbn-10":"1787281140","isbn-13":"978-1787281141","pages":"694 pages","publication date":"December 6, 2016","publisher":"Packt Publishing","size":"27.00Mb"},"img":"http://23.95.221.108/covers/2a/2a74aabc63a7ef4092ba855f47ea3824.jpg","link":"https://rapidhosting.info/files/7wi","title":"Mastering Django: Core"}