{"categories":["Data Management","Manual","Programming"],"desc":" About This Book Explore various tools and their strengths while building meaningful representations that can make it easier to understand data Packed with computational methods and algorithms in diverse fields of science Written in an easy-to-follow categorical style, this book discusses some niche techniques that will make your code easier to work with and reuse Who This Book Is For If you are a Python developer who performs data visualization and wants to develop your existing Python knowledge, then this book is for you. A basic knowledge level and understanding of Python libraries is assumed. What You Will Learn Gather, cleanse, access, and map data to a visual framework Recognize which visualization method is applicable and learn best practices for data visualization Get acquainted with reader-driven narratives, author-driven narratives, and the principles of perception Understand why Python is an effective tool for numerical computation much like MATLAB, and explore some interesting data structures that come with it Use various visualization techniques to explore how Python can be very useful for financial and statistical computations Compare Python with other visualization approaches using Julia and a JavaScript-based framework such as D3.js Discover how Python can be used in conjunction with NoSQL, such as Hive, to produce results efficiently in a distributed environment In Detail Python has a handful of open source libraries for numerical computations that involve optimization, linear algebra, integration, interpolation, and other special functions using array objects, machine learning, data mining, and plotting. This book offers practical guidance to help you on the journey to effective data visualization. Commencing with a chapter on the data framework, the book covers the complete visualization process, using the most popular Python libraries with working examples. You will learn how to use NumPy, SciPy,","details":{"authors":"Kirthi Raman","format":"pdf","isbn-10":"1783988320","isbn-13":"978-1783988327","pages":"305 pages","publication date":"October 30, 2015","publisher":"Packt Publishing - ebooks Account","size":"12.14Mb"},"img":"http://23.95.221.108/covers/29/2905b8d752c964b94bf41f215f394819.jpg","link":"https://rapidhosting.info/files/e5y","title":"Mastering Python Data Visualization"}