{"categories":["Manual"],"desc":" Exploit design, deployment, and management of large-scale containers Key Features Explore the latest features available in Kubernetes 1.10 Ensure that your clusters are always available, scalable, and up to date Master the skills of designing and deploying large clusters on various cloud platforms Book DescriptionKubernetes is an open source system that is used to automate the deployment, scaling, and management of containerized applications. If you are running more containers or want automated management of your containers, you need Kubernetes at your disposal. To put things into perspective, Mastering Kubernetes walks you through the advanced management of Kubernetes clusters. To start with, you will learn the fundamentals of both Kubernetes architecture and Kubernetes design in detail. You will discover how to run complex stateful microservices on Kubernetes including advanced features such as horizontal pod autoscaling, rolling updates, resource quotas, and persistent storage backend. Using real-world use cases, you will explore the options for network configuration, and understand how to set up, operate, and troubleshoot various Kubernetes networking plugins. In addition to this, you will get to grips with custom resource development and utilization in automation and maintenance workflows. To scale up your knowledge of Kubernetes, you will encounter some additional concepts based on the Kubernetes 1.10 release, such as Promethus, Role-based access control, API aggregation, and more. By the end of this book, you’ll know everything you need to graduate from intermediate to advanced level of understanding Kubernetes. What you will learn Architect a robust Kubernetes cluster for long-time operation Discover the advantages of running Kubernetes on GCE, AWS, Azure, and bare metal Understand the identity model of Kubernetes, along with the options for cluster federation Monitor and troubleshoot Kubernetes clusters and run a highly available Kubernetes Create and configure custom Kubernetes resources and use third-party resources in your automation workflows Enjoy the art of running complex stateful applications in your container environment Deliver applications as standard packages Who this book is forMastering Kubernetes is for you if you are a system administrator or a developer who has an intermediate understanding of Kubernetes and wish to master its advanced features. Basic knowledge of networking would also be helpful. In all, this advanced-level book provides a smooth pathway to mastering Kubernetes.","details":{"authors":null,"format":"epub","isbn-10":"1788999789","isbn-13":"978-1788999786","pages":"468 pages","publication date":"April 26, 2018","publisher":"Packt Publishing","size":"6.32Mb"},"img":"http://23.95.221.108/covers/6c/6ccea8ca8231a875217163aa3c6c7a92.jpg","link":"https://rapidhosting.info/files/h94","title":"Mastering Kubernetes"}