{"categories":["Databases","Management","Manual","Programming","Scripting","Web Development"],"desc":" This book is an upgrade to phpMyAdmin Version 2.8. Written by a member of the development team, this book serves as a comprehensive guide to helping you unlock the full potential of phpMyAdmin 3.8   phpMyAdmin Providing a powerful graphical interface for managing MySQL, phpMyAdmin is one of the most popular open source applications. While most MySQL developers use routine features of phpMyAdmin every day, few are aware of the power and potential of its advanced features. This book builds a solid understanding of the core capabilities of phpMyAdmin before walking you through every facet of this legendary tool.  MySQL Used by millions of developers, MySQL is the most popular open source database, supporting numerous large dynamic websites and applications. MySQL has acquired this wide popularity by virtue of its open source nature, performance, reliability, robustness, and support for various platforms. However, this popularity has also been helped by the existence of phpMyAdmin, the industry standard administration tool that makes database management easy for both the experienced developer and their novice.   The powerful graphical interface that it provides to MySQL has made phpMyAdmin an indispensable tool for MySQL and web developers. Every phpMyAdmin user can benefit from unlocking the full potential of this powerful application.   Whether you are an experienced developer, system administrator, web designer or new to MySQL and phpMyAdmin, this book will show you how to increase your productivity and control when working with your databases. You will learn how to: – Administer MySQL users and privileges, and get statistics about MySQL servers and databases – Manage databases, table data and structures, and indexes – Use bookmarks and metadata – Generate multiple SQL queries – Generate better documentation of evolving table structures  Along the way you will build a more detailed understanding of SQL and how it works in MySQL.  As an application developer you’ll learn how to use phpMyAdmin to: – Effectively perform day-to-day database and table management. – Create efficient database tables and relational structures – Document your evolving data structure easily  As a MySQL server administrator, you will  benefit from the in-depth and practical coverage of: – Using phpMyAdmin to manage users and privileges – Getting server and database statistics  All database users will be able to expand and refine their knowledge of SQL in a MySQL context by using phpMyAdmin to track SQL execution and results.  The prior edition of this book was written for version 2.6. Most of the changes to phpMyAdmin in version 3.8 are in the user interface and not the underlying functionality. This book brings the screen shots and user instructions into line with the new interface. If as a reader you are happy with the new interface already you don’t need to upgrade to this new edition of the book.  The book begins with a comprehensive tutorial of phpMyAdmin that systematically explains and demonstrates the potential of this tool. It then goes on to show the less well known and generally under-used features and capabilities of phpMyAdmin in depth.   Whether you are an experienced developer, system administrator, web designer or new to MySQL, phpMyAdmin is a must have tool for anyone who needs to manage MySQL databases and tables. This book is a must read for every serious phpMyAdmin user who would like to use this outstanding application to its full power.","details":{"authors":"Marc Delisle","format":"pdf","isbn-10":"1847191606","isbn-13":"978-1847191601","pages":"316 pages","publication date":"October 10, 2006","publisher":"Packt Publishing","size":"6.00Mb"},"img":"http://23.95.221.108/covers/54/54a9b14fb951648a895ada024539e593.jpg","link":"https://rapidhosting.info/files/8zb","title":"Mastering Phpmyadmin for Effective MySQL Management 2e"}