{"categories":["Programming","Software"],"desc":" This book will take your App-V skills to the ultimate level. Dig deep into the technology and learn stuff you never knew existed. The step-by-step approach makes it surprisingly easy to realize the full potential of App-V. Overview Understand advanced topics in App-V; identify some rarely known components and options available in the platform Acquire advanced guidelines on how to troubleshoot App-V installations, sequencing, and application deployments Learn how to handle particular applications, adapting companys’ policies to the implementation, enforcing application licenses, securing the environment, and so on Virtualize server applications by using the upcoming platform Server App-V Step-by-step explanations to maximize the utility of App-V in your application infrastructure What you will learn from this book Perform sequencing in complex environments including scenarios where App-V is normally not supported Deploy your applications using HTTP/S or configure standalone modes for local and SMB Streaming in complex scenarios such as adjusting communication ports for application delivery Get hands on in how to implement the scripting process within App-V applications and also review how to use App-V command lines Troubleshoot App-V Scale-up App-V implementations by using failover and load balanced scenarios Review App-V integration with VDI and Remote Desktop Services Integrate App-V with SCCM 2012 Examine 3rd party tools available in App-V Approach A practical tutorial containing clear, step-by-step explanations of all the concepts required to understand the technology involved in virtualizing your application infrastructure. Each chapter uses real-world scenarios so that the readers can put into practice what they learn immediately and with the right guidance. Each topic is written defining a common need and developing the process to solve it using Microsoft App-V. Who this book is written for This book is for","details":{"authors":"Augusto Alvarez","format":"pdf","isbn-10":"1849684480","isbn-13":"978-1849684484","pages":"474 pages","publication date":"March 26, 2012","publisher":"Packt Publishing","size":"15.75Mb"},"img":"http://23.95.221.108/covers/95/958160ceda28f1eae3261243694a2761.jpg","link":"https://rapidhosting.info/files/gyh","title":"Microsoft Application Virtualization Advanced Guide"}