{"categories":["Databases","Manual","Security","Software","Sysadmin"],"desc":" Over 70 practical, focused recipes to bullet-proof your SQL Server database and protect it from hackers and security threats Practical, focused recipes for securing your SQL Server database Master the latest techniques for data and code encryption, user authentication and authorization, protection against brute force attacks, denial of service attacks, and SQL Injection, and more A learn by example recipe based approach that focuses on key concepts to provide the foundation to solve real world problems In Detail In 2011, a big corporation suffered a 23-day network outage after a breach of security that allowed the theft of millions of registered accounts on its gaming network. A month later, hackers claimed in a press release to have stolen personal information of 1 million users by a single SQL injection attack. In these days of high-profile hacking, SQL Server 2012 database security has become of prime importance Microsoft SQL Server 2012 Security Cookbook will show you how to secure your database using cutting-edge methods and protect it from hackers and other security threats. You will learn the latest techniques for data and code encryption, user authentication and authorization, protection against brute force attacks, denial-of-service attacks, and SQL Injection, securing business intelligence, and more. We will start with securing SQL Server right from the point where you install it. You will learn to secure your server and network with recipes such as managing service SIDs, configuring a firewall for SQL Server access, and encrypting the session by SSL. We will then address internal security: creating logins to connect to SQL Server, and users to gain access to a database. We will also see how to grant privileges to securable objects on the server or inside the database.","details":{"authors":"Rudi Bruchez","format":"pdf","isbn-10":"1849685886","isbn-13":"978-1849685887","pages":"322 pages","publication date":"August 21, 2012","publisher":"Packt Publishing","size":"7.29Mb"},"img":"http://23.95.221.108/covers/e9/e901dc109f66ac4b7680c6bfc4efe4c8.jpg","link":"https://rapidhosting.info/files/9wx","title":"Microsoft SQL Server 2012 Security Cookbook"}