{"categories":["Databases","Engineering","Manual","Software","Sysadmin"],"desc":" MDX-related books often dedicate a significant part of their content to explaining the concepts of multidimensional cubes, the MDX language and its functions, and other specifics related to working with Analysis Services. And that’s perfectly fine, there should be books like that, the tutorials that teach the concepts. However, that also means that when it comes to examples, there’s usually not enough space to provide all the details about them and their variations, otherwise the book would become huge or oftentimes lose its focus. The result of that is that making a step further from the provided calculations and queries might not be an easy task for an average reader. The other problem with tutorials is that the solution to a particular problem might be scattered throughout the book, which is where the cookbook style of books like this one come into play. Similar to data warehouses where we consolidate many tables of the relational database into a few and then organize those dimension tables in a topic-based star schema, in cookbooks we aggregate the information about a particular problem in form of one or more recipes and present that topic-based knowledge in full detail. Both the relational databases and the data warehouses have their purpose; it’s not uncommon to see them together in one place. The same is true about books and their approaches. What we also know is that there are far too few data warehouses than relational databases. Again, the same is with MDX-related cookbooks in respect to MDX tutorials, particularly those dealing with advanced topics. As a writer, I hope you recognize my intention and the value this book could bring you. As a reader, we rarely have enough time to start reading a book, not to mention f nish it. This is another advantage of the cookbook format. You can browse through the contents and look for the solution to a particular problem. As the recipes are relatively short and organized in chapters, that task won’t take much of your time. All the information will be in one place. In addition to that, you’ll see which recipes are related to that one, so that you can learn even more.","details":{"authors":"Tomislav Piasevoli","format":"pdf","isbn-10":"1849681309","isbn-13":"978-1849681308","pages":"480 pages","publication date":"August 9, 2011","publisher":"Packt Publishing","size":"7.00Mb"},"img":"http://23.95.221.108/covers/28/282fb09ca0f2efae1dfb6c40fd7ac93d.jpg","link":"https://rapidhosting.info/files/8bb","title":"MDX with Microsoft SQL Server 2008 R2 Analysis Services Cookbook"}