{"categories":["Manual","Operating Systems","Software","Sysadmin"],"desc":" 60 recipes for getting the most out of WCF and WF services, including the latest capabilities in AppFabric 1.1 for Windows Server Overview Gain a solid understanding of the capabilities provided by Windows Server AppFabric with a pragmatic, hands-on, results-oriented approach with this book and eBook. Learn how to apply the WCF and WF skills you already have to make the most of what Windows Server AppFabric has to offer Includes step-by-step recipes for developing highly scalable composite services that utilize the capabilities provided by Windows Server AppFabric including caching, hosting, monitoring and persistence. In Detail & l Windows Server AppFabric provides a set of integrated capabilities that extend IIS and the Windows Server platform making it easier to build, scale and manage composite applications today. Windows Server AppFabric delivers the first wave of innovation within an exciting new middleware paradigm which brings performance, scalability and enhanced management capabilities to the platform for applications built on the .NET Framework using Windows Communication Foundation and Windows Workflow Foundation. ‘Microsoft Windows Server AppFabric Cookbook’ shows you how to get the most from WCF and WF services using Windows Server AppFabric leveraging the capabilities for building composite solutions on the .NET platform. Packed with over 60 task-based and immediately reusable recipes, ‘Microsoft Windows Server AppFabric Cookbook’ starts by showing you how to set up your development environment to start using Windows Server AppFabric quickly. The book then moves on to provide comprehensive coverage of the most important capabilities provided by Windows Server AppFabric, diving right in to hands-on topics such as deploying WCF and WF applications to Windows Server AppFabric and leveraging the distributed caching, scalable hosting, persistence, monitoring and management capabilities that extend IIS","details":{"authors":"Hammad Rajjoub, Rick G. Garibay","format":"pdf","isbn-10":"1849684189","isbn-13":"978-1849684187","pages":"428 pages","publication date":"July 26, 2012","publisher":"Packt Publishing","size":"12.09Mb"},"img":"http://23.95.221.108/covers/c5/c5ee91ae75b43a64e5e7a6bc8d9b7283.jpg","link":"https://rapidhosting.info/files/du2","title":"Microsoft Windows Server AppFabric Cookbook"}