{"categories":["Databases","Software","Sysadmin"],"desc":" This is the complete guide to keeping your SQL server applications up and running at all times. You’ll learn how to minimize downtime, speed up recovery, and achieve the highest levels of availability and reliability. Overview Install various SQL Server High Availability options in a step-by-step manner A guide to SQL Server High Availability for DBA aspirants, proficient developers and system administrators Learn the pre and post installation concepts and common issues you come across while working on SQL Server High Availability Tips to enhance performance with SQL Server High Availability External references for further study What you will learn from this book Learn about the prerequisites for installing SQL Server HA Understand the windows domain and various handshake methods Understand SQL Server’s authentication mechanism and SQL Server security Configure and manage database mirroring for high availability Handle cluster management and backup Use log shipping to provide database-level redundancy by automatically backing up, copying, and restoring transaction logs on servers Increase scalability, availability, and processing capacity by configuring applications to use peer-to-peer replication Monitor the performance of SQL Server HA Explore the concepts of SQL Server clustering, different types of SQL cluster Approach With clear step-by-step instructions, various real world examples, and plenty of screenshots, this book provides all the support and guidance you will need as you begin to install various SQL Server HA options. Who this book is written for If you are an SQL Server developer, or a system administrator, or even a novice DBA, then this book is for you. It only requires you to have a basic understanding of how SQL Server works to get you through the installation of SQL Server HA. In Detail Every business has it’s mission critical applications and data. Therefore, it is very important to keep database","details":{"authors":"Hemantgiri S. Goswami","format":"pdf","isbn-10":"1849681228","isbn-13":"978-1849681223","pages":"308 pages","publication date":"January 24, 2011","publisher":"Packt Publishing","size":"12.84Mb"},"img":"http://23.95.221.108/covers/2e/2e23ea1fd20384046e8d791014e3af1f.jpg","link":"https://rapidhosting.info/files/g72","title":"Microsoft SQL Server 2008 High Availability"}