{"categories":["Computing","Engineering","Mobile Development","Programming","Sysadmin","Telecommunications"],"desc":" This proceedings volume includes the full research papers presented at the First Int- national Conference on Mobile Computing, Applications, and Services (MobiCASE) held in San Diego, California, during October 26-29, 2009. It was sponsored by ICST and held in conjunction with the First Workshop on Innovative Mobile User Inter- tivity (WIMUI). MobiCASE highlights state-of-the-art academic and industry research work in – main topics above the OSI transport layer with an emphasis on complete end-to-end systems and their components. Its vision is largely influenced by what we see in the consumer space today: high-end mobile phones, high-bandwidth wireless networks, novel consumer and enterprise mobile applications, scalable software infrastructures, and of course an increasingly larger user base that is moving towards an almost a- mobile lifestyle. This year’s program spanned a wide range of research that explored new features, algorithms, and infrastructure related to mobile platforms. We received submissions from many countries around the world with a high number from Europe and Asia in addition to the many from North America. Each paper received at least three in- pendent reviews from our Technical Program Committee members during the Spring of 2009, with final results coming out in July. As a result of the review process, we selected 15 high-quality papers and complemented them with six invited submissions from leading researchers, reaching the final count of 21 papers in the program.","details":{"authors":"Petros Zerfos, Rebecca Montanari, Thomas Phan","format":"pdf","isbn-10":"3642126065","isbn-13":"978-3642126062","pages":"406 pages","publication date":"May 11, 2010","publisher":"Springer","size":"11.20Mb"},"img":"http://23.95.221.108/covers/1d/1d54d0cdaa6f771ca4cd4448989556e8.jpg","link":"https://rapidhosting.info/files/av6","title":"Mobile Computing, Applications, and Services: First International ICST Conference, MobiCASE 2009, San Diego, CA, USA, October 26-29, 2009, Revised … and Telecommunications Engineering)"}