{"categories":["Web Development"],"desc":" Teachers, don’t be intimidated by e-learning! This book shows you how to take your existing course materials and transfer them quickly, effectively and – above all – easily into an e-learning course using Moodle. Absolute beginners welcome. Overview Move your existing course notes, worksheets, and resources into Moodle quickly No need to start from scratch! This book shows you the quickest way to start using Moodle and e-learning, by bringing your existing lesson materials into Moodle Demonstrates quick ways to improve your course, taking advantage of multimedia and collaboration Requires no prior knowledge of Moodle, even experienced Moodlers will find this useful for converting ‘paper’ resources and face-to-face lessons into Moodle What you will learn from this book Incorporate your existing handouts, worksheets, and other resources into Moodle courses Quick methods to make your Moodle courses engaging, attractive, and fun Fast ways to add multimedia to your course, or incorporate existing sounds and videos Using Moodle as a repository for departmental guidelines and documentation Move marking online! See how students can submit their assignments straight into Moodle, for you to mark assess on the computer – no more backbreaking boxes of assignments to lug to and from school Use forums and messaging to keep in contact with students when it’s convenient, rather than having them call into your office during your breaks or preparation time See how you can make your course a completely online experience – dispensing with face time all together Approach With clear instructions and plenty of screenshots, this book provides all the support and guidance you will need as you begin to convert your teaching to Moodle. Step-by-step tutorials use real-world examples to show you how to convert to Moodle in the most efficient and effective ways possible. Moodle Course Conversion carefully illustrates how Moodle can be used","details":{"authors":"Ian Wild","format":"pdf","isbn-10":"1849514828","isbn-13":"978-1849514828","pages":"368 pages","publication date":"November 17, 2011","publisher":"Packt Publishing","size":"13.72Mb"},"img":"http://23.95.221.108/covers/15/1529021fde33ef551603bbc71587313e.jpg","link":"https://rapidhosting.info/files/fxx","title":"Moodle 2.0 Course Conversion Beginner’s Guide"}