{"categories":["Engineering","Game Development"],"desc":" This lecture introduces fundamental principles of online multiplayer games, primarily massively multiplayer online role-playing games (MMORPGs), suitable for students and faculty interested both in designing games and in doing research on them. The general focus is human-centered computing, which includes many human-computer interaction issues and emphasizes social computing, but also, looks at how the design of socio-economic interactions extends our traditional notions of computer programming to cover human beings as well as machines. In addition, it demonstrates a range of social science research methodologies, both quantitative and qualitative, that could be used by students for term papers, or by their professors for publications. In addition to drawing upon a rich literature about these games, this lecture is based on thousands of hours of first-hand research experience inside many classic examples, including World of Warcraft, The Matrix Online, Anarchy Online, Tabula Rasa, Entropia Universe, Dark Age of Camelot, Age of Conan, Lord of the Rings Online, Tale in the Desert, EVE Online, Star Wars Galaxies, Pirates of the Burning Sea, and the non-game virtual world Second Life. Among the topics covered are historical-cultural origins of leading games, technical constraints that shape the experience, rolecoding and social control, player personality and motivation, relationships with avatars and characters, virtual professions and economies, social relations inside games, and the implications for the external society. Table of Contents: Introduction / Historical-Cultural Origins / Technical Constraints / Rolecoding and Social Control / Personality and Motivation / Avatars and Characters / Virtual Professions and Economies / Social Relations Inside Games / Implications for External Society","details":{"authors":"William Sims Bainbridge, Gary Marchionini","format":"pdf","isbn-10":"1608451429","isbn-13":"978-1608451425","pages":"114 pages","publication date":"January 13, 2010","publisher":"Morgan and Claypool Publishers","size":"1.00Mb"},"img":"http://23.95.221.108/covers/ce/ce7720339b064302191d84b1fd4c7677.jpg","link":"https://rapidhosting.info/files/8og","title":"Online Multiplayer Games (Synthesis Lectures on Information Concepts, Retrieval, and S)"}