{"categories":["Data Management","Programming"],"desc":" Continuing the success of the popular second edition, the updated and revised Object-Oriented Data Structures Using Java, Third Edition is sure to be an essential resource for students learning data structures using the Java programming language. It presents traditional data structures and object-oriented topics with an emphasis on problem-solving, theory, and software engineering principles. Beginning early and continuing throughout the text, the authors introduce and expand upon the use of many Java features including packages, interfaces, abstract classes, inheritance, and exceptions. Numerous case studies provide readers with real-world examples and demonstrate possible solutions to interesting problems. The authors’ lucid writing style guides readers through the rigor of standard data structures and presents essential concepts from logical, applications, and implementation levels. Key concepts throughout the Third Edition have been clarified to increase student comprehension and retention, and end-of-chapter exercises have been updated and modified. New and Key Features to the Third Edition: -Includes the use of generics throughout the text, providing the dual benefits of allowing for a type safe use of data structures plus exposing students to modern approaches. -This text is among the first data structures textbooks to address the topic of concurrency and synchonization, which are growing in the importance as computer systems move to using more cores and threads to obtain additional performance with each new generation. Concurrency and synchonization are introduced in the new Section 5.7, where it begins with the basics of Java threads. -Provides numerous case studies and examples of the problem solving process. Each case study includes problem description, an analysis of the problem input and required output, and a discussion of the appropriate data structures to use. -Expanded chapter exercises allow you as the instructor to reinforce topics for your students using both theoretical and practical questions. -Chapters conclude with a chapter summary that highlights the most important topics of the chapter and ties together related topics. Instructor Resources: -Answers to the exercises in the text -Glossary of terms -PowerPoint Lecture Outlines -Test bank","details":{"authors":"Nell Dale, Daniel T. Joyce, Chip Weems","format":"pdf","isbn-10":"1449613543","isbn-13":"978-1449613549","pages":"802 pages","publication date":"March 11, 2011","publisher":"Jones & Bartlett Learning","size":"33.00Mb"},"img":"http://23.95.221.108/covers/90/9041a5f02e8983150b94eee139f0fe88.jpg","link":"https://rapidhosting.info/files/aqk","title":"Object-Oriented Data Structures Using Java"}