{"categories":["Programming"],"desc":" Today all computers, from tablet/desktop computers to super computers, work in parallel. A basic knowledge of the architecture of parallel computers and how to program them, is thus, essential for students of computer science and IT professionals. In its second edition, the book retains the lucidity of the first edition and has added new material to reflect the advances in parallel computers. It is designed as text for the final year undergraduate students of computer science and engineering and information technology. It describes the principles of designing parallel computers and how to program them. This second edition, while retaining the general structure of the earlier book, has added two new chapters, ‘Core Level Parallel Processing’ and ‘Grid and Cloud Computing’ based on the emergence of parallel computers on a single silicon chip popularly known as multicore processors and the rapid developments in Cloud Computing. All chapters have been revised and some chapters are re-written to reflect the emergence of multicore processors and the use of MapReduce in processing vast amounts of data. The new edition begins with an introduction to how to solve problems in parallel and describes how parallelism is used in improving the performance of computers. The topics discussed include instruction level parallel processing, architecture of parallel computers, multicore processors, grid and cloud computing, parallel algorithms, parallel programming, compiler transformations, operating systems for parallel computers, and performance evaluation of parallel computers. Interspersed with copious examples and numerous exercises, this timely textbook would be a handy and treasured volume for students as well as working professionals.","details":{"authors":"V. Rajaraman, C. Siva Ram Murthy","format":"pdf","isbn-10":"8120352629","isbn-13":"978-8120352629","pages":"492 pages","publication date":"July 30, 2016","publisher":"Prentice-Hall of India Pvt.Ltd","size":"17.00Mb"},"img":"http://23.95.221.108/covers/9a/9ae46f2174a9dd77a2ad1e9c3ed3ee5f.jpg","link":"https://rapidhosting.info/files/bdt","title":"Parallel Computers: Architecture and Programming"}