{"categories":["Manual"],"desc":" This book is unique in its coverage of all the features of pfSense, empowering you to exploit the firewall’s full potential. With clear instructions and detailed screenshots, it helps you configure even the most advanced features. Overview Harness the power of pfSense’s core functionality Get under the hood to see how pfSense performs load balancing and failover Detailed examples of interfaces, firewall rules, NAT port-forwarding, VPN services, and much, much more! Full of illustrations, diagrams, and tips for making the most of any pfSense implementation using clear step-by-step instructions for relevant and practical examples What you will learn from this book Determine your deployment scenario, hardware/throughput/interface requirements, form-factor, and which platform version of pfSense is right for you Secure remote access using the SSH and/or HTTPS protocols Add, assign, and configure network interfaces Configure essential networking services (such as DHCP, DNS, Dynamic DNS) Create aliases, firewall rules, NAT port-forward rules, and rule schedules Enable external Remote Desktop Access to an internal machine, following a complete example of the core pfSense functionality Configure the PPTP, IPSec, L2TP, and/or OpenVPN services Create virtual IPs, a virtual LAN, 1:1 and outbound NAT rules, gateways, static routes, and bridged interfaces Configure traffic-shaping and Quality of Service (QoS) Create multiple WAN interfaces in load-balanced or failover configurations Configure firewall redundancy with a CARP firewall failover Configure external logging with syslog Use a variety of built-in networking tools such as Ping and traceroute Configuration backup/restoration and automatic configuration-file backup Update the pfSense firmware Monitor and view all sorts of system and feature statuses/logs using RRD graphs and status monitoring tools Approach This book is written in a cookbook style. Each chapter consists of","details":{"authors":"Matt Williamson","format":"pdf","isbn-10":"9781849514","isbn-13":"978-1849514866","pages":"252 pages","publication date":"March 23, 2011","publisher":"Packt Publishing","size":"10.60Mb"},"img":"http://23.95.221.108/covers/8c/8c90347b2dc7ee51efd22c25282bd19c.jpg","link":"https://rapidhosting.info/files/g7m","title":"pfSense 2 Cookbook"}