{"categories":["Manual"],"desc":" Over 60 hands-on recipes to create dynamic and reactive web-based applications with Play 2 About This Book Create and build modern web applications using Play 2 Learn how to integrate Play 2.x with databases, third party modules, Restful APIs, and more Explore various features and optimizations added to Play 2.x using practical example-oriented scenarios Who This Book Is For This book is aimed at advanced developers who are looking to harness the power of Play 2.x. This book will also be useful for professionals looking to dive deeper into web development. Play 2 .x is an excellent framework to accelerate your learning of advanced topics. What You Will Learn Implement the Model-View-Controller (MVC) web architecture with Play 2 Convert data between incompatible type systems using ORM tools such as Ebean and Anorm Serve and receive JSON messages to transmit data objects Create long-running, asynchronous controllers using Akka Learn to use modules for Amazon S3, Redis, and MongoDB Consume public APIs using the Play WS API Make your application production-ready by integrating it with AngularJS Automate the creation of a portable development environment using Vagrant Deploy Play 2 applications with Docker In Detail As web and mobile systems become more sophisticated, anchoring systems in a mature, solid framework has become increasingly important. Play 2 provides developers with the necessary tools to build robust web applications. This book is a compilation of useful recipes aimed at helping developers discover the power of Play 2. The introductory section serves as a primer to Play Framework, wherein all the fundamentals of the framework are covered extensively. It then explains the usage of controllers and how modules can be leveraged for optimal performance. Next, the book walks you through creating and using APIs, followed by extensive real-world applications. Finally, you will learn to manage applications post","details":{"authors":"Alexander Reelsen, Giancarlo Inductivo","format":"pdf","isbn-10":"1784393134","isbn-13":"978-1784393137","pages":"345 pages","publication date":"June 12, 2015","publisher":"Packt Publishing - ebooks Account","size":"3.00Mb"},"img":"http://23.95.221.108/covers/ca/ca2ac9a4ccb9376dfe22e253b1b05ddc.jpg","link":"https://rapidhosting.info/files/gpt","title":"Play Framework Cookbook – Second edition"}