{"categories":["Manual"],"desc":" Over 60 incredibly effective recipes to take you under the hood and leverage advanced concepts of the Play framework Make your application more modular, by introducing you to the world of modules. Keep your application up and running in production mode, from setup to monitoring it appropriately. Integrate play applications into your CI environment Keep performance high by using caching Learn how to leverage external APIs without letting your application go down on problems Use the play framework as a provider for your API systems Implement your own authorization mechanisms, and different output formats In Detail The Play framework is the new kid on the block of Java frameworks. By breaking with existing standards the play framework tries not to abstract away from HTTP as most web frameworks do, but tightly integrates with it. This means quite a shift for Java programmers. Understanding these concepts behind the play framework and its impact on web development with Java are crucial for fast development of applications. The Play Framework Cookbook starts where the beginner documentation ends. It shows you how to utilize advanced features of the Play framework – piece by piece and completely outlined with working applications! The reader will be taken through all layers of the Play Framework and provided with in-depth knowledge from as many examples and applications as possible. Leveraging the most from the Play framework means to think simple again in a java environment. Implement your own renderers, integrate tightly with HTTP, use existing code, improve site performance with caching and integrate with other web services and interfaces. Learn about non-functional issues like modularity or integration into production and testing environments. In order to provide the best learning experience during reading Play Framework Cookbook, almost every example is provided with source code, so you can start immediately to integra","details":{"authors":"Alexander Reelsen","format":"pdf","isbn-10":"1849515522","isbn-13":"978-1849515528","pages":"292 pages","publication date":"August 8, 2011","publisher":"Packt Publishing","size":"3.22Mb"},"img":"http://23.95.221.108/covers/8e/8eec86cb43df9702a37e6681ac10fef0.jpg","link":"https://rapidhosting.info/files/gh6","title":"Play Framework Cookbook"}