{"categories":["Databases"],"desc":" Leverage the power of PostgreSQL 10 to design, administer and maintain a high-performance database solution Key Features Obtain optimal PostgreSQL 10 database performance, ranging from initial design to routine maintenance Fine tune the performance of your queries and avoid the common pitfalls that can slow your system down Contains tips and tricks on scaling successful database installations, and ensuring a highly available PostgreSQL solution Book DescriptionPostgreSQL database servers have a common set of problems that they encounter as their usage gets heavier and requirements get more demanding. Peek into the future of your PostgreSQL 10 database’s problems today. Know the warning signs to look for and how to avoid the most common issues before they even happen. Surprisingly, most PostgreSQL database applications evolve in the same way-choose the right hardware, tune the operating system and server memory use, optimize queries against the database and CPUs with the right indexes, and monitor every layer, from hardware to queries, using tools from inside and outside PostgreSQL. Also, using monitoring insight, PostgreSQL database applications continuously rework the design and configuration. On reaching the limits of a single server, they break things up; connection pooling, caching, partitioning, replication, and parallel queries can all help handle increasing database workloads. By the end of this book, you will have all the knowledge you need to design, run, and manage your PostgreSQL solution while ensuring high performance and high availability What you will learn Learn best practices for scaling PostgreSQL 10 installations Discover the best hardware for developing high-performance PostgreSQL applications Benchmark your whole system – from hardware to application Learn by real examples how server parameters impact performance Discover PostgreSQL 10 features for partitioning and parallel query Monitor your server, both inside and outside the database Design and implement a good replication system on PostgreSQL 10 Who this book is forThis book is designed for database administrators and PostgreSQL architects who already use or plan to exploit the features of PostgreSQL 10 to design and maintain a high-performance PostgreSQL database. A working knowledge of SQL, and some experience with PostgreSQL will be helpful in getting the most out of this book.","details":{"authors":null,"format":"epub","isbn-10":"1788474481","isbn-13":"978-1788474481","pages":"508 pages","publication date":"April 30, 2018","publisher":"Packt Publishing","size":"3.59Mb"},"img":"http://23.95.221.108/covers/3e/3e5b2758fcd95594c64a073b6e8a9734.jpg","link":"https://rapidhosting.info/files/h96","title":"PostgreSQL 10 High Performance"}