{"categories":["Computer Science","Engineering","Hardware","Uncategorized"],"desc":"The Internet of Things is a great new challenge for the development of digital systems. In addition to the increasing number of classical unconnected digital systems, more people are regularly using new electronic devices and software that are controllable and usable by means of the internet. All such systems utilize the elementariness of Boolean values. A Boolean variable can carry only two different Boolean values: FALSE or TRUE (0 or 1), and has the best interference resistance in technical systems. However, a Boolean function exponentially depends on the number of its variables. This exponential complexity is the cause of major problems in the process of design and realization of circuits. According to Moores Law, the complexity of digital systems approximately doubles every 18 months. This requires comprehensive knowledge and techniques to solve complex Boolean problems. This book summarizes both new problems and solutions in the Boolean domain in solving such issues. Part 1 describes powerful new approaches in solving exceptionally complex Boolean problems. Efficient methods contribute to solving problems of extreme complexity. New algorithms and programs utilize the huge number of computing cores of the Graphical Processing Unit and improve the performance of calculations by several orders of magnitude. Part 2 represents several applications of digital systems. Due to the crucial role of the internet, both solutions and open problems regarding the security of these systems are discussed. The exploration of certain properties of such systems leads to a number of efficient solutions, which can be reused in a wide field of applications. Part 3 discusses the scientific basis of future circuit technologies, investigating the need for completely new design methods for the atomic level of quantum computers. This part also concerns itself with reversible circuits as the basis for quantum circuits and specifies important issues regarding future improvements.","details":{"authors":"Bernd Steinbach","format":"pdf","isbn-10":"1443889474","isbn-13":"978-1443889476","pages":"480 pages","publication date":"May 1, 2016","publisher":"Cambridge Scholars Publishing","size":"3.85Mb"},"img":"http://23.95.221.108/covers/45/452177fa6ae1b1d0c3ee5d216627a782.jpg","link":"https://rapidhosting.info/files/e4t","title":"Problems and New Solutions in the Boolean Domain"}