{"categories":["Programming"],"desc":" Today’s leading media theorist offers everyone a practical yet mind-blowing guide to our digital world. The debate over whether the Net is good or bad for us fills the airwaves and the blogosphere. But for all the heat of claim and counter-claim, the argument is essentially beside the point: it’s here; it’s everywhere. The real question is, do we direct technology, or do we let ourselves be directed by it and those who have mastered it? Choose the former writes Rushkoff, and you gain access to the control panel of civilization. Choose the latter, and it could be the last real choice you get to make. In ten chapters, composed of ten commands, accompanied by original illustrations from comic artist Leland Purvis, Rushkoff provides cyberenthusiasts and technophobes alike with the guidelines to navigate this new universe. In this spirited, accessible poetics of new media, Rushkoff picks up where Marshall McLuhan left off, helping readers come to recognize programming as the new literacy of the digital age–and as a template through which to see beyond social conventions and power structures that have vexed us for centuries. This is a friendly little book with a big and actionable message. World-renowned media theorist and counterculture figure Douglas Rushkoff is the originator of ideas such as viral media, social currency and screenagers. He has been at the forefront of digital society from its beginning, predicting the rise of the net, the dotcom boom and bust, as well as today’s financial crisis. He is a familiar voice on NPR, and correspondent for Frontline Digital Nation. Here’s the first field manual on how to remain human on the internet.– Kevin Kelly, What Technology Wants Rushkoff is damn smart. As someone who understood the digital revolution faster and better than almost anyone, he shows how the internet is a social transformer that should change the way your business culture operates. -Walter Isaacson","details":{"authors":"Leland Purvis","format":"pdf","isbn-10":"1935928155","isbn-13":"978-1935928157","pages":"140 pages","publication date":"November 2, 2010","publisher":"OR Books","size":"2.00Mb"},"img":"http://23.95.221.108/covers/e4/e45a018e3aa5419d564d48c73a2421b2.jpg","link":"https://rapidhosting.info/files/esc","title":"Program or Be Programmed: Ten Commands for a Digital Age"}