{"categories":["Digital Design/Media","Manual","Programming"],"desc":" Learn how to use Python’s built-in graphics capabilities to create static and animated graphics for a range of real-world purposes. Over 100 recipes take you from basic shape creation to developing interactive GUIs. Overview Create captivating graphics with ease and bring them to life using Python Apply effects to your graphics using powerful Python methods Develop vector as well as raster graphics and combine them to create wonders in the animation world Create interactive GUIs to make your creation of graphics simpler Part of Packt’s Cookbook series: Each recipe is a carefully organized sequence of instructions to accomplish the task of creation and animation of graphics as efficiently as possible Who This Book Is For If you are looking to create animated graphics to represent real-world scenarios then this book is for you. Teachers, scholars, students, and engineers who know it is possible to make fascinating models and demonstrations but have not found a handbook that pulls it all together in one place will find what they need in this recipe bank. Basic knowledge of Python programming is required and access to the Web and Google will be useful. What You Will Learn Install Python and create basic programs for making lines and shapes Apply different colors to your graphics using widgets and schemes available with the Tkinter module Work with raster images and animate them by combining vector images with raster images Optimize the storage and retrieval of graphics using hard disks, datastreams, and so on Develop GUIs for different purposes to enhance your interaction with the programs Move graphic objects smoothly around a screen by adding minimum delay and shift Explore alternative ways and means of getting graphic shape data into Tkinter programs Create beautiful patterns by setting any number of pivot points in different directions Use trajectory traces to examine the history of execution required for animating","details":{"authors":"Mike Ohlson de Fine","format":"pdf","isbn-10":"1849513848","isbn-13":"978-1849513845","pages":"260 pages","publication date":"November 24, 2010","publisher":"Packt Publishing","size":"5.00Mb"},"img":"http://23.95.221.108/covers/d1/d1cf55480e4a9b790599eec504a689ba.jpg","link":"https://rapidhosting.info/files/bsr","title":"Python 2.6 Graphics Cookbook"}