{"categories":["Hardware","Manual","Programming"],"desc":" Over 50 easy to comprehend tailor made recipes to get the most out of the Raspberry Pi and unleash its huge potential using Python About This Book Install your first operating system, share files over the network, and run programs remotely Unleash the hidden potential of the Raspberry Pi’s powerful Video Core IV graphics processor with your own hardware accelerated 3D graphics Discover how to create your own electronic circuits to interact with the Raspberry Pi Interface with purpose-built add-ons and adapt off-the-shelf household devices Who This Book Is For The aim of this book is to bring you a broad range of Python 3 examples and practical ideas which you can develop to suit your own requirements. By modifying and combining the examples to create your own projects you learn far more effectively with a much greater understanding. Each chapter is designed to become a foundation for further experimentation and discovery of the topic, providing you with the tools and information to jump right in. Readers are expected to be familiar with programming concepts and Python (where possible Python 3 is used), although beginners should manage with the help of a good Python reference book and background reading. No prior knowledge of the Raspberry Pi or electronics is required; however for the hardware sections you will need some basic electronic components/household tools to build some of the projects. What You Will Learn Set up and run Raspberry Pi for the first time Develop desktop applications, and handle images and process files with ease Make use of graphics and user control to develop your own exciting games Create 3D worlds by using the Raspberry Pi’s powerful GPU Discover how to create your own electronic circuits to interact with the Raspberry Pi Use the Raspberry Pi Camera to create animations and time lapses Design and build your own Raspberry Pi controlled robots Take control of the real world and interface","details":{"authors":"Tim Cox","format":"pdf","isbn-10":"1849696624","isbn-13":"978-1849696623","pages":"358 pages","publication date":"April 16, 2014","publisher":"Packt Publishing - ebooks Account","size":"54.61Mb"},"img":"http://23.95.221.108/covers/7c/7c4f42fcd8a1b699a83278cc961ead81.jpg","link":"https://rapidhosting.info/files/8li","title":"Raspberry Pi Cookbook for Python Programmers"}