{"categories":["Web Development"],"desc":" React 16 Tooling covers in detail the most important tools, utilities, and libraries that every React developer needs to know. About This Book * Each chapter presents meta-development solutions to help React developers. * The tools used are presented in a practical, solution-oriented approach with no fluff. * The chapters are arranged in a logical order that mirrors a typical React development workflow, but the reader is free to tweak the approaches discussed to fit their own unique style Who This Book Is For This book is targeted at React developers of any skill level who want to make their lives easier. It will help to have some familiarity with React, but if you are an experienced web developer looking at React, then this book will show you how to build a resilient toolset around you before you begin. What You Will Learn * How to bootstrap React application development using create-react-app * How to isolate React component development using Storybook * How to write effective unit tests for your React components using Jest * How to ensure that your component code is to standard using ESLint * How to use browser extensions and built-in component instrumentation to debug React applications * How to enable type safety in React components by introducing Flowtype to your build * How to deploy React applications inside a Docker container as part of a larger application stack In Detail As React has grown, the amazing toolset around it has grown, adding features and enhancing the development workflow. These range from essential third-party tools, such as Jest for carrying out testing, to official first-party tools, such as create-react-app that most developers use for bootstrapping new React applications. React 16 Tooling covers in detail the most important tools, utilities and libraries that every React developer needs to know. These will make your development life simpler and happier, enabling you to create better and more performant apps. React 16 Tooling presents a hand-picked selection of the best tools for the React 16 ecosystem. For starters, there’s the create-react-app utility that’s officially supported by the React team. Not only does this tool bootstrap your React project for you, it also provides a consistent and stable framework to build upon. The premise is that when you don’t have to think about meta development work, more focus goes into the product itself. Other React tools follow this same approach to automating and improving your development life. Jest makes unit testing easier. The React devtools browser plugin makes debugging components easier. Flow makes catching common type errors easy. Storybook makes developing components in isolation easier. ESLint makes writing standardized quality React code easier. Docker containers make deploying React applications in a stack easier.In this book, we’ll look at each of these powerful tools in detail, showing you how to build the perfect React ecosystem to develop your apps within.","details":{"authors":null,"format":"epub","isbn-10":"1788835018","isbn-13":"978-1788835015","pages":"298 pages","publication date":"April 27, 2018","publisher":"Packt Publishing","size":"10.47Mb"},"img":"http://23.95.221.108/covers/ea/ea13b3d8b6e16f0ecbf5bf0ccd5f4427.jpg","link":"https://rapidhosting.info/files/h8m","title":"React 16 Tooling"}