{"categories":["Programming","Software"],"desc":" This book is a superb practical guide for any developer considering refactoring their code with Visual Studio. Its accessible approach covers all aspects of updating your C# code base to make it maintainable and adaptable. Overview Make your code base maintainable with refactoring Support new features more easily by making your system adaptable Enhance your system with an improved object-oriented design and increased encapsulation and componentization Concepts are presented in a comfortable one-on-one, pair-programming style A practical approach that’s packed with examples to enrich understanding What you will learn from this book Improve code readability by applying effective concepts and techniques Spot discrepancies in code with code smells Catch and eliminate dead code and learn several such smart methods Make changes to your code without introducing adverse side-effects with code maintainability Learn smart ways to improve code navigability Improve your design by applying design principles and methodologies Enhance the maintainability of your code base by refactoring it to be more cohesive and less coupled Obtain an optimal level of flexibility by refactoring your code to a loosely-coupled design Minimize the side effects and support changes to your code by refactoring to a layered architecture Support your evolving code base by refactoring architectural behavior Back up the refactoring effort by ensuring quality with Unit Testing Approach This book focuses on real-world, easy-to-understand examples of code in a one-on-one style. Refactoring examples are performed and reasons why this refactoring should be applied are detailed. The book is structured from less advanced topics to more advanced topics; but is designed so that reading from beginning to end is not necessary. Who this book is written for This book is primarily for developers who want to refactor their code in Visual Studio. However, the book can be","details":{"authors":"Peter Ritchie","format":"pdf","isbn-10":"1849680108","isbn-13":"978-1849680103","pages":"372 pages","publication date":"July 26, 2010","publisher":"Packt Publishing","size":"11.00Mb"},"img":"http://23.95.221.108/covers/17/1701c82143b30302a73a28c5c59ddd38.jpg","link":"https://rapidhosting.info/files/dh7","title":"Refactoring with Microsoft Visual Studio 2010"}