{"categories":["Designing","Programming","Web Development"],"desc":" Design and implement scalable and maintainable RESTful solutions with Node.js 10 Key Features Create rich and scalable RESTful API solutions from scratch Explore the new features of Node.js 10, Express 4.0, and MongoDB Integrate MongoDB in your Node.js application to store and secure your data Book DescriptionWhen building RESTful services, it is really important to choose the right framework. Node.js, with its asynchronous, event-driven architecture, is exactly the right choice for building RESTful APIs. This third edition of RESTful Web API Design with Node.js 10 will teach you to create scalable and rich RESTful applications based on the Node.js platform. You will be introduced to the latest NPM package handler and understand how to use it to customize your RESTful development process. You will begin by understanding the key principle that makes an HTTP application a RESTful-enabled application. After writing a simple HTTP request handler, you will create and test Node.js modules using automated tests and mock objects; explore using the NoSQL database, MongoDB, to store data; and get to grips with using self-descriptive URLs. You’ll learn to set accurate HTTP status codes along with understanding how to keep your applications backward-compatible. Also, while implementing a full-fledged RESTful service, you will use Swagger to document the API and implement automation tests for a REST-enabled endpoint with Mocha. Lastly, you will explore some authentication techniques to secure your application. What you will learn Install, develop, and test your own Node.js user modules Understand the differences between HTTP and RESTful applications Use self-descriptive URLs and set accurate HTTP status codes Eliminate third-party dependencies in your tests with mocking Implement automation tests for a REST-enabled endpoint with Mocha Secure your services with NoSQL database integration within Node.js applications Integrate a simple frontend using JavaScript libraries available on a CDN server Who this book is forIf you are a web developer keen to enrich your development skills to create server-side RESTful applications based on the Node.js platform, this book is for you. Some knowledge of REST would be an added advantage, but is definitely not a necessity.","details":{"authors":null,"format":"epub","isbn-10":"1788623320","isbn-13":"978-1788623322","pages":"178 pages","publication date":"April 30, 2018","publisher":"Packt Publishing","size":"2.09Mb"},"img":"http://23.95.221.108/covers/55/557690262b22107951cbb4677b02b662.jpg","link":"https://rapidhosting.info/files/h90","title":"Restful Web API Design with Node.Js 10, Third Edition"}