{"categories":["Engineering"],"desc":" Knowledge and expertise, especially of the kind that can shape public opinion, have been traditionally the domain of individuals holding degrees awarded by higher learning institutions or occupying formal positions in notable organizations. Expertise is validated by reputations established in an institutionalized marketplace of ideas with a limited number of “available seats” and a stringent process of selection and retention of names, ideas, topics and facts of interest. However, the social media revolution, which has enabled over two billion Internet users not only to consume, but also to produce information and knowledge, has created a secondary and very active informal marketplace of ideas and knowledge. Anchored by platforms like Wikipedia, YouTube, Facebook and Twitter, this informal marketplace has low barriers to entry and has become a gigantic and potentially questionable, knowledge resource for the public at large. Roles, Trust and Reputation in Social Media Knowledge Markets will discuss some of the emerging trends in defining, measuring and operationalizing reputation as a new and essential component of the knowledge that is generated and consumed online. The book will propose a future research agenda related to these issues. The ultimate goal of research agenda being to shape the next generation of theoretical and analytic strategies needed for understanding how knowledge markets are influenced by social interactions and reputations built around functional roles. The authors, including leading scholars and young innovators, will share with the readers some of the main lessons they have learned from their own work in these areas and will discuss the issues, topics and sub-areas that they find under-studied or that promise the greatest intellectual payoff in the future. The discussion will be placed in the context of social network analysis and “big data” research. Roles, Trust and Reputation in Social Media Knowledge Markets exposes issues that have not been satisfactorily dealt with in the current literature, as the research agenda in reputation and authorship is still emerging. In a broader sense, the volume aims to change the way in which knowledge generation in social media spaces is understood and utilized. The tools, theories and methodologies proposed by the contributors offer concrete avenues for developing the next generation of research strategies and applications that will help: tomorrow’s information consumers make smarter choices, developers to create new tools and researchers to launch new research programs.","details":{"authors":null,"format":"epub","isbn-10":"331905466X","isbn-13":"978-3319054667","pages":"198 pages","publication date":"September 3, 2014","publisher":"Springer","size":"1.51Mb"},"img":"http://23.95.221.108/covers/f5/f5a627ffd426e725e433ef0c4027dbbf.jpg","link":"https://rapidhosting.info/files/hcw","title":"Roles, Trust, and Reputation in Social Media Knowledge Markets: Theory and Methods (Computational Social Sciences)"}