{"categories":["Programming","Security"],"desc":" Protect your organisation by building a security-minded culture  “With this book, Kai Roer has taken his many years of cyber experience and provided those with a vested interest in cyber security a firm basis on which to build an effective cyber security training programme.” Dr. Jane LeClair Chief Operating Officer National Cybersecurity Institute, Washington, D.C. Human nature – easy prey for hackers?  Human behaviour is complex and inconsistent, making it a rich hunting ground for would-be hackers and a significant risk to the security of your organisation . An effective way to address this risk is to create a culture of security. Using the psychology of group behaviour and explaining how and why people follow social and cultural norms, the author highlights the underlying cause for many successful and easily preventable attacks. An effective framework for behavioural security  In this book Kai Roer presents his Security Culture Framework, and addresses the human and cultural factors in organisational security. The author uses clear, everyday examples and analogies to reveal social and cultural triggers that drive human behaviour . He explains how to manage these threats by implementing an effective framework for an organisational culture, ensuring that your organisation is set up to repel malicious intrusions and threats based on common human vulnerabilities. Contents      What is security culture?     The Elements of security culture     How does security culture relate to security awareness?     Asking for help raises your chances of success     The psychology of groups and how to use it to your benefit     Measuring culture     Building security culture  About the author  Kai Roer is a management and security consultant and trainer with extensive international experience from more than 30 countries around the world. He is a guest lecturer at several universities, and the founder of The Roer Group, a European management consulting group focusing on security culture.  Kai has authored a number of books on leadership and cyber security , has been published extensively in print and online, has appeared on radio and television, and has featured in printed media. He is a columnist at Help Net Security and has been the Cloud Security Alliance Norway chapter president since 2012.  Kai is a passionate public speaker who engages his audience with his entertaining style and deep knowledge of human behaviours , psychology and cyber security . He is a Fellow of the National Cybersecurity Institute and runs a blog on information security and culture (roer.com). Kai is the host of Security Culture TV, a monthly video and podcast. Series information  Build a Security Culture is part of the Fundamentals Series, co-published by IT Governance Publishing and Information Security Buzz.  Build a security-minded culture within your organisation – buy this book today and get the help and guidance you need.","details":{"authors":"IT Governance Publishing","format":"pdf","isbn-10":"1849287163","isbn-13":"978-1849287166","pages":"1 pages","publication date":"March 12, 2015","publisher":"It Governance Publishing","size":"0.00Mb"},"img":"http://23.95.221.108/covers/05/05ae1cdbac1db7c441575050893782d2.jpg","link":"https://rapidhosting.info/files/9z1","title":"Build a Security Culture  (Fundamentals Series)"}