{"categories":["Algorithms","Engineering","Robotics","Web Development"],"desc":" By the dawn of the new millennium, robotics has undergone a major transf- mation in scope and dimensions. This expansion has been brought about by the maturity of the ?eld and the advances in its related technologies. From a largely dominant industrial focus, robotics has been rapidly expanding into the challenges of the human world. The new generation of robots is expected to safely and dependably co-habitat with humans in homes, workplaces, and c- munities, providing support in services, entertainment, education, healthcare, manufacturing, and assistance. Beyond its impact on physical robots, the body of knowledge robotics has produced is revealing a much wider rangeof applications reaching across diverse research areas and scienti?c disciplines, such as: biomechanics, haptics, n- rosciences, virtual simulation, animation, surgery, and sensor networks among others. In return, the challenges of the new emerging areas are proving an ab- dant source of stimulation and insights for the ?eld of robotics. It is indeed at the intersection of disciplines that the most striking advances happen. The goal of the series of Springer Tracts in Advanced Robotics (STAR) is to bring, in a timely fashion, the latest advances and developments in robotics on thebasisoftheirsigni?canceandquality.Itisourhopethatthewiderdissemi- tion of research developments will stimulate more exchanges and collaborations among the research community and contribute to further advancement of this rapidly growing ?eld.","details":{"authors":null,"format":"pdf","isbn-10":"354088064X","isbn-13":"978-3540880646","pages":"188 pages","publication date":"January 22, 2009","publisher":"Springer","size":"24.18Mb"},"img":"http://23.95.221.108/covers/10/102ed5f46650df33e88c1db639e6530f.jpg","link":"https://rapidhosting.info/files/h5k","title":"Sharing a Vision: Systems and Algorithms for Collaboratively-Teleoperated Robotic Cameras (Springer Tracts in Advanced Robotics)"}