{"categories":["Engineering"],"desc":" Social media platforms have been ubiquitously used in our daily lives and are steadily transforming the ways people communicate, socialize and conduct business. However, the growing popularity of social media adversely leads to wild spread of unreliable information. This in turn inevitably creates serious pollution problem of the global social media environment, which is harmful against humanity. For example, President Donald Trump used social media strategically to win in the 2016 USA Presidential Election. But it was found that many messages he delivered over social media were unproven, if not untrue. This problem must be prevented at all cost and as soon as possible. Thus, analysis of social media content is a pressing issue. It is a timely and important research subject worldwide. However, the short and informal nature of social media messages renders conventional content analysis, which is based on natural language processing (NLP), ineffective. This volume consists of a collection of highly relevant scientific articles published by the authors in different international conferences and journals, and is divided into three distinct parts: (I) search and filtering; (II) opinion and sentiment analysis; and (III) event detection and summarization. This book presents the latest advances in NLP technologies for social media content analysis, especially content on microblogging platforms such as Twitter and Weibo.","details":{"authors":"Kam-Fai Wong, Wei Gao, Ruifeng Xu, Wenjie Li","format":"pdf","isbn-10":"981322360X","isbn-13":"978-9813223608","pages":"488 pages","publication date":"November 28, 2017","publisher":"World Scientific Publishing Company","size":"24.79Mb"},"img":"http://23.95.221.108/covers/65/65ba8958165938bff3c7a15a1105cee5.jpg","link":"https://rapidhosting.info/files/cyj","title":"Social Media Content Analysis: Natural Language Processing and Beyond (Series on Language Processing, Pattern Recognition, and Intelligent Systems)"}