{"categories":["Algorithms","Programming"],"desc":" The subject of this book is the solution of polynomial equations, that is, s- tems of (generally) non-linear algebraic equations. This study is at the heart of several areas of mathematics and its applications. It has provided the – tivation for advances in di?erent branches of mathematics such as algebra, geometry, topology, and numerical analysis. In recent years, an explosive – velopment of algorithms and software has made it possible to solve many problems which had been intractable up to then and greatly expanded the areas of applications to include robotics, machine vision, signal processing, structural molecular biology, computer-aided design and geometric modelling, as well as certain areas of statistics, optimization and game theory, and b- logical networks. At the same time, symbolic computation has proved to be an invaluable tool for experimentation and conjecture in pure mathematics. As a consequence, the interest in e?ective algebraic geometry and computer algebrahasextendedwellbeyonditsoriginalconstituencyofpureandapplied mathematicians and computer scientists, to encompass many other scientists and engineers. While the core of the subject remains algebraic geometry, it also calls upon many other aspects of mathematics and theoretical computer science, ranging from numerical methods, di?erential equations and number theory to discrete geometry, combinatorics and complexity theory. Thegoalofthisbookistoprovideageneralintroduction tomodernma- ematical aspects in computing with multivariate polynomials and in solving algebraic systems.","details":{"authors":"Alicia Dickenstein, Ioannis Z. Emiris","format":"pdf","isbn-10":"3540243267","isbn-13":"978-3540243267","pages":"426 pages","publication date":"June 23, 2005","publisher":"Springer","size":"4.08Mb"},"img":"http://23.95.221.108/covers/03/031c7d9436c0abb301dda8e8a0969e1b.jpg","link":"https://rapidhosting.info/files/h3o","title":"Solving Polynomial Equations: Foundations, Algorithms, and Applications (Algorithms and Computation in Mathematics)"}