{"categories":["Manual","Programming"],"desc":" With over 100 recipes, this Cookbook is ideal for both beginners and advanced Tcl/Tk programmers. From the basics to creating applications, it’s full of indispensable tips and tricks to make the most of the language. Overview The quickest way to solve your problems with Tcl/Tk 8. Understand the basics and fundamentals of the Tcl/Tk 8 programming language Learn graphical User Interface development with the Tcl/Tk 8 Widget set Get a thorough and detailed understanding of the concepts with a real-world address book application Each recipe is a carefully organized sequence of instructions to efficiently learn the features and capabilities of the Tcl/Tk 8 language What you will learn from this book Expand your Tcl/Tk abilities by gaining in-depth knowledge of the core commands Learn efficient programming by using control constructs in your program Handle numerous types of string expressions by performing formatting, searches, and advanced manipulations on them Gain expertise in using lists with examples teaching you the various available operations Demystify the Tcl Dictionary and learn how it can be a viable substitute for a third-party database Perform various operations on the dictionary elements in both single and multiple layer dictionaries Create, manage, and empower your Graphical User Interface with Tk window management, to develop attractive applications Ease your file system access with an in-depth study of File operations Perform advanced error trapping and recovery with error handling commands in Tcl Approach This book provides a step-by-step approach to the Tcl/Tk language with the help of re-usable examples and images. It is a series of carefully organized, easy-to-follow, standalone recipes to solve your queries. Whether you go through the recipes chapter-wise or pick up any recipe randomly, you will find clear and complete explanation of the task covered in the recipe. Who this book is written for If you","details":{"authors":"Bert Wheeler","format":"pdf","isbn-10":"1849512981","isbn-13":"978-1849512985","pages":"236 pages","publication date":"February 11, 2011","publisher":"Packt Publishing","size":"1.00Mb"},"img":"http://23.95.221.108/covers/ce/cebfa3d6a05ad0109f20018661dd16a6.jpg","link":"https://rapidhosting.info/files/7rh","title":"Tcl/Tk 8.5 Programming Cookbook"}