{"categories":["Uncategorized"],"desc":" Bring a new level of Quality Assurance to your application development by learning to utilize Continuous Integration using TeamCity. This totally practical tutorial is perfect for developers, QA engineers, and project managers. Overview Put Continuous Integration into operation with TeamCity, quickly and easily with this practical tutorial. Set automatic build checks and notifications according to your needs and configure multi-step builds with dependent and interrelated projects easily. Plug TeamCity either to existing on-going development or at the project’s very beginning. Perform fine-tuning adjustments of the TeamCity Server What you will learn from this book Create basic Java web application from scratch . Write simple Unit tests with JUnit. Install TeamCity and perform its initial setup. Attach TeamCity to existing application source base. Set up automatic build triggering and notifications. Create multi-step inter-dependent build configurations. Add and configure Users and Groups settings. Install and authorize additional BuildAgents. Keep rock-solid confidence in project stability. Approach A step-by-step practical tutorial towards succesfully applying Continous Integration with TeamCity. Who this book is written for This book is great for developers willing to start utilizing Continuous Integration on a daily basis and does not really care how experienced you are at your programming skills. You may not need to be a programmer at all in order to use all advantages of the TeamCity. Quality Assurance engineers would benefit from this book as there’s enough information explaining how to maintain build configuration for tests and administer TeamCity Server. Even project managers and other managerial staff distanced from actual working with the code will find their value in TeamCity as they will be kept abreast of the project current status. In Detail Nowadays, Agile application development is usually done at a","details":{"authors":"Volodymyr Melymuka","format":"pdf","isbn-10":"1849693765","isbn-13":"978-1849693769","pages":"128 pages","publication date":"December 26, 2012","publisher":"Packt Publishing","size":"3.28Mb"},"img":"http://23.95.221.108/covers/b3/b3f1312e76033229ae434a0c714e608f.jpg","link":"https://rapidhosting.info/files/d2t","title":"TeamCity 7 Continuous Integration"}