{"categories":["Machine Learning"],"desc":" This book is a collection of writings by active researchers in the field of Artificial General Intelligence, on topics of central importance in the field. Each chapter focuses on one theoretical problem, proposes a novel solution, and is written in sufficiently non-technical language to be understandable by advanced undergraduates or scientists in allied fields. This book is the very first collection in the field of Artificial General Intelligence (AGI) focusing on theoretical, conceptual, and philosophical issues in the creation of thinking machines. All the authors are researchers actively developing AGI projects, thus distinguishing the book from much of the theoretical cognitive science and AI literature, which is generally quite divorced from practical AGI system building issues.  And the discussions are presented in a way that makes the problems and proposed solutions understandable to a wide readership of non-specialists, providing a distinction from the journal and conference-proceedings literature.  The book will benefit AGI researchers and students by giving them a solid orientation in the conceptual foundations of the field (which is not currently available anywhere); and it would benefit researchers in allied fields by giving them a high-level view of the current state of thinking in the AGI field.   Furthermore, by addressing key topics in the field in a coherent way, the collection as a whole may play an important role in guiding future research in both theoretical and practical AGI, and in linking AGI research with work in allied disciplines","details":{"authors":"Pei Wang, Ben Goertzel","format":"pdf","isbn-10":"9491216619","isbn-13":"978-9491216619","pages":"334 pages","publication date":"September 1, 2012","publisher":"Atlantis Press","size":"7.00Mb"},"img":"http://23.95.221.108/covers/75/75c8d64e31748ee9fa9b4bda8befebbf.jpg","link":"https://rapidhosting.info/files/amc","title":"Theoretical Foundations of Artificial General Intelligence (Atlantis Thinking Machines)"}