{"categories":["Computer Science","Engineering","Programming"],"desc":" This Festschrift volume, dedicated to He Jifeng on the occasion of his 70th birthday in September 2013, includes 24 refereed papers by leading researchers, current and former colleagues, who congratulated at a celebratory symposium held in Shanghai, China, in the course of the 10th International Colloquium on Theoretical Aspects of Computing, ICTAC 2013. The papers cover a broad spectrum of subjects, from foundational and theoretical topics to programs and systems issues and to applications, comprising formal methods, software and systems modeling, semantics, laws of programming, specification and verification, as well as logics. He Jifeng is known for his seminal work in the theories of programming and formal methods for software engineering. He is particularly associated with Unifying Theories of Programming (UTP) , the theory of data refinement and the laws of programming, and the rCOS formal method for object and component system construction. His book on UTP with Tony Hoare has been widely read and followed by a large number of researchers, and it has been used in many postgraduate courses. He was a senior researcher at Oxford during 1984-1998, and then a senior research fellow at the United Nations University International Institute for Software Technology (UNU-IIST) in Macau during 1998-2005. He has been a professor and currently the Dean of the Institute of Software Engineering at East China Normal University, Shanghai, China. In 2005, He Jifeng was elected as an academician to the Chinese Academy of Sciences. He also received an honorary doctorate from the University of York. He won a number of prestigious science and technology awards, including a 2nd prize of Natural Science Award from the State Council of China, a 1st prize of Natural Science Award from the Ministry of Education of China, a 1st prize of Technology Innovation from the Ministry of Electronic Industry, and a number awards from Shanghai government.","details":{"authors":"Zhiming Liu, Jim Woodcock, Huibiao Zhu","format":"pdf","isbn-10":"3642396976","isbn-13":"978-3642396977","pages":"413 pages","publication date":"July 10, 2013","publisher":"Springer","size":"5.34Mb"},"img":"http://23.95.221.108/covers/ef/efd8886ac49016f9e353ee02f8cfda13.jpg","link":"https://rapidhosting.info/files/ffu","title":"Theories of Programming and Formal Methods: Essays Dedicated to Jifeng He on the Occasion of His 70th Birthday (Lecture Notes in Computer Science)"}