{"categories":["Designing","Web Development"],"desc":" This is the book for web designers, web developers, and front-end coders who want to get up to speed with HTML5 in 2012. This is the book that isn’t afraid to point out what everyone gets wrong about HTML5’s new markup, so you don’t make the same mistakes. This is the book that will show you what rocks in HTML5 today and what the future holds for interactivity and video now Flash is dying. This is the book that doesn’t think marking up a basic web page should be a quasi-religious exercise where the high priests of HTML5 must be consulted for their interpretation of the holy texts (the HTML5 spec). This is the book that doesn’t pull its punches. This is the book for web professionals who think for themselves. This is the book that tells the truth about HTML5. === 5 Reasons You Should Read The Truth About HTML5 1. Learn HTML5 markup the right way After spending an insane number of hours researching HTML5’s new markup I discovered one disturbing fact: everyone gets it wrong. Really. Don’t waste hours trawling through confusing, poorly researched, and often flat-out wrong blog posts (or books). Get the truth on HTML5’s markup in chapter three and chapter four. 2. Learn about the future of semantics Did you know Google, Yahoo! and Microsoft teamed up in 2011 to launch a new, potentially groundbreaking semantics initiative using HTML5’s new microdata standard? They did, and the new semantics are being used by major sites like eBay and IMDB right now. In chapter seven you’ll be brought up to speed on one of the biggest changes to semantics to ever hit the web. 3. Learn what HTML5 features you can implement today HTML5 isn’t one big blob of technology that will be “finished” at some point in the future. It’s a grab bag of cool stuff, much of which has been around for years. Learn what’s well supported and ready to go today in 2012, including new forms features in chapter eight, and the new audio and video possibilities in chapter ten. 4. Learn what happens when Flash dies The writing is on the wall for Flash. Apple never supported it on mobile; Adobe (Adobe!) have given up on the plug-in for Android; and Microsoft won’t support it in IE10 in the default desktop experience of Windows 8. (Let that sink in for a moment.) Clients will demand HTML5 equivalents of what was done with Flash so we’ll look at what HTML’s Canvas can do in chapter nine and what HTML5 video can (and can’t) do in chapter ten. 5. HTML5 for CMSs, and beyond HTML5 Finally in chapter twelve we’ll look at some of the web app oriented features of HTML5, one of which (the History API) changes something as fundamental as a page refresh. We’ll also touch on features that we should be demanding asking politely to be included in our CMSs, and we’ll look briefly at some post-HTML5 web standards development for mobile that’s becoming a reality right now.","details":{"authors":"Luke Stevens","format":"pdf","isbn-10":"1479158569","isbn-13":"978-1479158560","pages":"268 pages","publication date":"May 18, 2012","publisher":"CreateSpace Independent Publishing Platform","size":"4.00Mb"},"img":"http://23.95.221.108/covers/38/381605a12bd60694634a3abf94be7986.jpg","link":"https://rapidhosting.info/files/8t6","title":"The Truth About HTML5 (For Web Designers)"}