{"categories":["Computing","Programming"],"desc":" In 2011 many computer users were exploring the opportunities and the benefits of the massive parallelism offered by heterogeneous computing. In 2000 the Khronos Group, a not-for-profit industry consortium, was founded to create standard open APIs for parallel computing, graphics and dynamic media. Among them has been OpenCL, an open system for programming heterogeneous computers with components made by multiple manufacturers. This publication explains how heterogeneous computers work and how to program them using OpenCL. It also describes how to combine OpenCL with OpenGL for displaying graphical effects in real time. Chapter 1 describes briefly two older de facto standard and highly successful parallel programming systems: MPI and OpenMP. Collectively, the MPI, OpenMP, and OpenCL systems cover programming of all major parallel architectures: clusters, shared-memory computers, and the newest heterogeneous computers. Chapter 2, the technical core of the book, deals with OpenCL fundamentals: programming, hardware, and the interaction between them. Chapter 3 adds important information about such advanced issues as double-versus-single arithmetic precision, efficiency, memory use, and debugging. Chapters 2 and 3 contain several examples of code and one case study on genetic algorithms. These examples are related to linear algebra operations, which are very common in scientific, industrial, and business applications. Most of the books examples can be found on the enclosed CD, which also contains basic projects for Visual Studio, MinGW, and GCC. This supplementary material will assist the reader in getting a quick start on OpenCL projects.","details":{"authors":"J. Kowalik, T. Puzniakowski","format":"pdf","isbn-10":"1614990298","isbn-13":"978-1614990291","pages":"312 pages","publication date":"March 15, 2012","publisher":"IOS Press","size":"3.00Mb"},"img":"http://23.95.221.108/covers/4f/4f39651836e5e5229d60f23e2d91954e.jpg","link":"https://rapidhosting.info/files/axc","title":"Using OpenCL:  Programming Massively Parallel Computers (Advances in Parallel Computing)"}