{"categories":["Web Development"],"desc":" Discover how to use the Oracle WebCenter Suite to introduce collaboration and dynamic communications in your enterprise’s web applications. Packed with screenshots and real-world examples, it will take your skills into the new era. Overview  Create task-oriented, rich, interactive online work environments with the help of this Oracle WebCenter training tutorial Accelerate the development of Enterprise 2.0 solutions by leveraging the Oracle tools Apply the basic concepts of Enterprise 2.0 for your business solutions by understanding them completely Prepare development environments that suit your enterprise needs using WebCenter applications Define collaborative work environments for the members of your organization Who This Book Is ForThis book is for web developers who need to improve their websites or business applications using Web 2.0 features.This book is recommended for you, if you are a:  Portal Developer who works with a traditional portal and wants to move onto new technologies Java Developer and want to add productivity features to your business applications Knowledge Managers and want to create collaborative environments and increase the productivity of your employees and organizational groupsWhat You Will Learn  Explore the relationship between the Oracle WebCenter suite and the application server Install and configure the core building blocks for WebCenter 11g in a Linux environment. Prepare the development environments and the application server in order to support your WebCenter applications Combine various kind of components such as portlets, data access components (tables and list of values), and components that promote participation (discussions, wikis) into a single user interface under the concept of a portal. Create a page template and based on it and develop user interfaces using ADF Faces Rich Client Integrate wiki and blog with WebCenter using an iFrame as well as using the Web Clipping","details":{"authors":"Plinio Arbizu, Ashok Aggarwal","format":"pdf","isbn-10":"1847195806","isbn-13":"978-1847195807","pages":"276 pages","publication date":"October 4, 2010","publisher":"Packt Publishing","size":"23.00Mb"},"img":"http://23.95.221.108/covers/dc/dcabfc146fef18c4bf626299d010348c.jpg","link":"https://rapidhosting.info/files/g33","title":"Web 2.0 Solutions with Oracle WebCenter 11g"}