{"categories":["Engineering","Networking"],"desc":" A step-by-step guide to configuring, using, and adapting this free Open Source network monitoring system Designed to quickly acquaint you with the core feature so you can customize Zenoss Core to your needs Discover, manage, and monitor IT resources Build custom event-processing and alerting rules Write custom device reports to extract, display, and analyze monitoring data A handy reference guide with loads of screenshots An update of Zenoss Core Network and System Monitoring rewritten for Zenoss 3.x In Detail For system administrators, network engineers, and security analysts, it is essential to keep a track of network traffic. Zenoss Core is an enterprise-level systems and network monitoring solution that can be as complex as you need it to be. And while just about anyone can install it, turn it on, and monitor “something” Zenoss Core has a complicated interface packed with features. The interface has been drastically improved over version 2, but it’s still not the type of software you can use intuitively in other words, a bit of guidance is in order. The role of this book is to serve as your Zenoss Core tour guide and save you hours, days, maybe weeks of time. This book will show you how to work with Zenoss and effectively adapt Zenoss for System and Network monitoring. Starting with the Zenoss basics, it requires no existing knowledge of systems management, and whether or not you can recite MIB trees and OIDs from memory is irrelevant. Advanced users will be able to identify ways in which they can customize the system to do more, while less advanced users will appreciate the ease of use Zenoss provides. The book contains step-by-step examples to demonstrate Zenoss Core’s capabilities. The best approach to using this book is to sit down with Zenoss and apply the examples found in these pages to your system. The book covers the monitoring basics: adding devices, monitoring for availability and performance, process","details":{"authors":"Michael Badger","format":"pdf","isbn-10":"1849511586","isbn-13":"978-1849511582","pages":"312 pages","publication date":"April 15, 2011","publisher":"Packt Publishing","size":"7.94Mb"},"img":"http://23.95.221.108/covers/c5/c563cae83305386a551891798321df34.jpg","link":"https://rapidhosting.info/files/ae7","title":"Zenoss Core 3.x Network and System Monitoring"}